Yoda49/RA8876-Driver-for-STM32F429ZIT6-FMC/RA8876_driver.c
#include "stm32f4xx.h"
#include "RA8876_driver.h"
#include "stm32f429_gpio.h"
#include "stm32f429_usart.h"


#define LCD_HW_RESET_LOW  GPIOB->BSRR |= (0x1UL << 29)
#define LCD_HW_RESET_HIGH GPIOB->BSRR |= (0x1UL << 13)




void delay_us (unsigned long i)
{
    while(i--) {};
}

void delay_ms (unsigned long i)
{
	unsigned char j;
	while (i--)
	{
		for(j=0; j < 125; j++);
	}
}


void Delay10ms (unsigned long i)
{	
	while(i--) delay_ms(10);
}

void Delay100ms(unsigned long i)
{	
	while(i--) delay_ms(100);
}



#define B0  0x0001
#define B1  0x0002
#define B2  0x0004
#define B3  0x0008
#define B4  0x0010
#define B5  0x0020
#define B6  0x0040
#define B7  0x0080
#define B8  0x0100
#define B9  0x0200
#define B10 0x0400
#define B11 0x0800
#define B12 0x1000
#define B13 0x2000
#define B14 0x4000
#define B15 0x8000

// ===========================================
// LCD WRITE COMMAND
// ===========================================
void LCD_CmdWrite(unsigned char cmd)
{
	*(unsigned short *)(LCD_REG) = cmd;
}

// ===========================================
// LCD WRITE DATA
// ===========================================
void LCD_DataWrite (unsigned short data)
{
	*(unsigned short *)(LCD_DATA)= data;
};


// ===========================================
// LCD STATUS READ
// ===========================================
unsigned char LCD_StatusRead(void) 
{	
	unsigned short data = *(unsigned short *)(LCD_REG);
	return data;
};

// ===========================================
// LCD READ DATA
// ===========================================
unsigned char LCD_DataRead(void) 
{
	unsigned short data = * (unsigned short *)(LCD_DATA);
	return (unsigned char)data;
};

 
// ===========================================
// LCD WRITE REGISTER
// ===========================================
void LCD_RegisterWrite(unsigned char cmd, unsigned char data)
{
	*(unsigned short *)(LCD_REG)  = cmd;
	*(unsigned short *)(LCD_DATA) = data;
}; 

// ===========================================
// LCD READ REGISTER
// ===========================================
unsigned char LCD_RegisterRead (unsigned char cmd)
{
   volatile unsigned char data = 0;
   LCD_CmdWrite (cmd);
   data = LCD_DataRead ();
   return data;
}

void LCD_WriteRAM_Prepare(void)
{
	LCD_CmdWrite (REG_MEMORY_DATA_READ_WRITE_PORT);
}

void RA8876_HW_Reset(void)
{
	LCD_HW_RESET_LOW;
    delay_ms(50);					   
	LCD_HW_RESET_HIGH;		 	 
    delay_ms(50);	
}


void LCD_SetPoint (unsigned short x, unsigned short y, unsigned short point)
{
	LCD_SetCursor        (x, y);
	LCD_WriteRAM_Prepare ();
	LCD_DataWrite        (point);
}









void LCD_SetCursor(unsigned short Xpos, unsigned short Ypos)
{
    LCD_CmdWrite(0x5F);
	LCD_DataWrite(Xpos);  
    LCD_CmdWrite(0x60);	   
	LCD_DataWrite(Xpos>>8);
    LCD_CmdWrite(0x61);
	LCD_DataWrite(Ypos);
    LCD_CmdWrite(0x62);	   
	LCD_DataWrite(Ypos>>8);
}	




void LCD_Clear (unsigned short Color)
{
	unsigned int index = 0;
  
	LCD_SetCursor(0,0); 
	LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */

	for (index = 0; index < 614400; index++) LCD_DataWrite(Color);
}



void RA8875_usart_show_register (char * header, unsigned char reg)
{
	usart1_send_string (header);
	usart1_send_char (' ');
	usart1_uchar8_binary(LCD_RegisterRead (reg));
	usart1_send_char ('\n');
}



void RA8876_Init(void)
{
	RA8876_PLL_Init(); 
	RA8876_SDRAM_Init();

   //**[01h]**//
	TFT_24bit();
	Host_Bus_16bit();
	
	//**[02h]**//
	RGB_16b_16bpp();
	
    //RGB_16b_24bpp_mode1();
	MemWrite_Left_Right_Top_Down();
	
	//**[03h]**//
	Graphic_Mode();
	Memory_Select_SDRAM();   

	HSCAN_L_to_R();
	VSCAN_T_to_B();
	PDATA_Set_RGB();

	//PCLK_Rising();
	PCLK_Falling();
	DE_High_Active();
	//HSYNC_Low_Active();
	HSYNC_High_Active();
	//VSYNC_Low_Active();
	VSYNC_High_Active(); 
	LCD_HorizontalWidth_VerticalHeight(1024,600);
	
	LCD_Horizontal_Non_Display(160);
	LCD_HSYNC_Start_Position  (160);
	LCD_HSYNC_Pulse_Width     ( 70);
	LCD_Vertical_Non_Display  ( 23);
	LCD_VSYNC_Start_Position  ( 12);
	LCD_VSYNC_Pulse_Width     ( 10);
  

	// CONFIGURE DISPLAY FRAME BUFFER
	Frame_Buffer_Start_Address(PAGE0_START_ADDR);
	Frame_Buffer_Width(1024);
	Frame_Buffer_Start_XY(0,0);
	Frame_Buffer_Color_Mode_16bpp();

	// CONFIGURE CURRENT CANVAS
	Canvas_Window_Start_Address(PAGE0_START_ADDR);
	Canvas_Window_Width(1024);
	Canvas_Window_Start_XY(0,0);
	Canvas_Window_WH(1024,600);
	Canvas_Memory_XY_Mode();
	Canvas_Window_Color_Mode_16bpp();
}

//==============================================================================
 void RA8876_PLL_Init (void) 
{
	// Set pixel clock
	if (SCAN_FREQ >= 63)
	{
		LCD_RegisterWrite(0x05,0x04);    //PLL Divided by 4
		LCD_RegisterWrite(0x06,(SCAN_FREQ * 4 / OSC_FREQ) - 1);
	}
	if (SCAN_FREQ >= 32 && SCAN_FREQ <= 62)
	{           
		LCD_RegisterWrite(0x05,0x06);    //PLL Divided by 8
		LCD_RegisterWrite(0x06,(SCAN_FREQ * 8 / OSC_FREQ) - 1);
	}
	if (SCAN_FREQ >= 16 && SCAN_FREQ <= 31)
	{           
		LCD_RegisterWrite(0x05,0x16);    //PLL Divided by 16
		LCD_RegisterWrite(0x06,(SCAN_FREQ * 16 / OSC_FREQ) - 1);
	}
        
 
  
	// Set SDRAM clock
	if (DRAM_FREQ >= 125)
	{
		LCD_RegisterWrite(0x07,0x02);    //PLL Divided by 2
		LCD_RegisterWrite(0x08,(DRAM_FREQ * 2 / OSC_FREQ) - 1);
	}
	if (DRAM_FREQ >= 63 && DRAM_FREQ <= 124)   //&&(DRAM_FREQ<=166)
	{
		LCD_RegisterWrite(0x07,0x04);    //PLL Divided by 4
		LCD_RegisterWrite(0x08,(DRAM_FREQ * 4 / OSC_FREQ) - 1);
	}
	if (DRAM_FREQ >= 31 && DRAM_FREQ <= 62)
	{           
		LCD_RegisterWrite(0x07,0x06);    //PLL Divided by 8
		LCD_RegisterWrite(0x08,(DRAM_FREQ * 8 / OSC_FREQ) - 1);
	}
	if (DRAM_FREQ <= 30)
	{
		LCD_RegisterWrite(0x07,0x06);    //PLL Divided by 8
		LCD_RegisterWrite(0x08,(30 * 8 / OSC_FREQ) - 1); //
	}
 

  // Set Core clock
	if (CORE_FREQ >= 125)
	{
		LCD_RegisterWrite(0x09,0x02);    //PLL Divided by 2
		LCD_RegisterWrite(0x0A,(CORE_FREQ * 2 / OSC_FREQ) - 1);
	}
	if (CORE_FREQ >= 63 && CORE_FREQ <= 124)     
	{
		LCD_RegisterWrite(0x09,0x04);    //PLL Divided by 4
		LCD_RegisterWrite(0x0A,(CORE_FREQ*4/OSC_FREQ)-1);
	}
	if(CORE_FREQ >= 31 && CORE_FREQ <= 62)
	{           
		LCD_RegisterWrite(0x09,0x06);    //PLL Divided by 8
		LCD_RegisterWrite(0x0A,(CORE_FREQ * 8 / OSC_FREQ) - 1);
	}
	if (CORE_FREQ <= 30)
	{
		LCD_RegisterWrite(0x09,0x06);    //PLL Divided by 8
		LCD_RegisterWrite(0x0A,(30 * 8 / OSC_FREQ) - 1); // 
	}

    LCD_CmdWrite(0x01);
	LCD_DataWrite(0x00);
	delay_us(10);
	LCD_DataWrite(0x80);
	//Enable_PLL();

