Yoda49/RA8876-Driver-for-STM32F429ZIT6-FMC/RA8876_driver.c
	delay_ms(1);
}



// ******************************************************************************
// SDRAM INIT
// ******************************************************************************
void RA8876_SDRAM_Init (void)
{

	unsigned short sdram_itv;

	LCD_RegisterWrite(0xe0, 0x29);      
	LCD_RegisterWrite(0xe1, 0x03);	//CAS:2=0x02，CAS:3=0x03

    sdram_itv = (64000000 / 8192) / (1000/DRAM_FREQ);
    sdram_itv -= 2;

	LCD_RegisterWrite(0xe2, sdram_itv);
	LCD_RegisterWrite(0xe3, sdram_itv >>8);
	LCD_RegisterWrite(0xe4, 0x01);

	Check_SDRAM_Ready();
 
	delay_ms(1);
}

// ******************************************************************************
// SUB STATUS
// ******************************************************************************
void Check_Mem_WR_FIFO_not_Full  (void) {while ( LCD_StatusRead() & 0x80)          {};}; // 0: Memory Write FIFO is not full.  1: Memory Write FIFO is full.
void Check_Mem_WR_FIFO_Empty     (void) {while ((LCD_StatusRead() & 0x40) == 0x00) {};}; // 0: Memory Write FIFO is not empty. 1: Memory Write FIFO is empty.
void Check_Mem_RD_FIFO_not_Full  (void) {while ( LCD_StatusRead() & 0x20)          {};}; // 0: Memory Read FIFO is not full.   1: Memory Read FIFO is full.
void Check_Mem_RD_FIFO_not_Empty (void) {while ( LCD_StatusRead() & 0x10)          {};}; // 0: Memory Read FIFO is not empty.  1: Memory Read FIFO is empty.
void Check_2D_Busy               (void) {while ( LCD_StatusRead() & 0x08)          {};};
void Check_SDRAM_Ready           (void) {while ((LCD_StatusRead() & 0x04) == 0x00) {};}; // 0: SDRAM is not ready for access   1: SDRAM is ready for access


unsigned char Power_Saving_Status(void)
{
	unsigned char temp;
	if((LCD_StatusRead()&0x02)==0x02) temp = 1; else temp = 0;
	return temp;
}

 
void Check_Power_is_Normal(void) {while( LCD_StatusRead()&0x02)           {};}; // 0: Normal operation state 1: Power saving state
void Check_Power_is_Saving(void) {while((LCD_StatusRead()&0x02) == 0x00 ) {};}; // 0: Normal operation state  1: Power saving state
void Check_NO_Interrupt   (void) {while( LCD_StatusRead()&0x01)           {};}; // 0: without interrupt event 1: interrupt event occur
void Check_Interrupt_Occur(void) {while((LCD_StatusRead()&0x01) == 0x00 ) {};}; // 0: without interrupt event 1: interrupt event occur

void Check_Busy_Draw(void)
{
	unsigned char temp;

//(A)
	do
	{
		temp = LCD_StatusRead();
	}	while(temp&0x08);
/*
//(B)
	do
	{
		LCD_CmdWrite(0x67);
		temp=LCD_DataRead();
	}	while(temp&0x80);

//(C)
	do
	{
		//(1)
		temp=LCD_RegisterRead(0x76);
		//(2)
		//LCD_CmdWrite(0x76);
		//temp=LCD_DataRead();
	}	while(temp&0x80);
*/

}

//[00h]=========================================================================

void RA8876_SW_Reset(void) //IC Reset，Register, Memory
{
	unsigned char temp;

	LCD_CmdWrite(0x00);
	temp = LCD_DataRead();

	temp |= 0x01;
	LCD_DataWrite(temp);

    do
    {
	    temp = LCD_DataRead();
    }
    while (temp & 0x01);
}

//[01h][01h][01h][01h][01h][01h][01h][01h][01h][01h][01h][01h][01h][01h][01h][01h]
void Enable_PLL(void)
{
/*  0: PLL disable; allow change PLL parameter.
    1: PLL enable; cannot change PLL parameter.*/
	unsigned char temp;
	LCD_CmdWrite(0x01);
	temp = LCD_DataRead();
	temp |= cSetb7;
	LCD_DataWrite(temp);

    delay_us(1);
}
void RA8876_Sleep(void)
{
/*  0: Normal mode.
    1: Sleep mode.*/
	unsigned char temp;
	LCD_CmdWrite(0x01);
	temp = LCD_DataRead();
	temp |= cSetb6;
	LCD_DataWrite(temp);
}
void RA8876_WakeUp(void)
{
/*  0: Normal mode.
    1: Sleep mode.*/
	unsigned char temp;
	LCD_CmdWrite(0x01);
	temp = LCD_DataRead();
	temp &= cClrb6;
	LCD_DataWrite(temp);
}

void TFT_24bit(void)
{
/*  00b: 24-bits output.
    01b: 18-bits output, unused pins are set as GPIO.
    10b: 16-bits output, unused pins are set as GPIO.
    11b: LVDS, all 24-bits unused output pins are set as GPIO.*/
	unsigned char temp;
	LCD_CmdWrite(0x01);
	temp = LCD_DataRead();
	temp &= cClrb4;
    temp &= cClrb3;
	LCD_DataWrite(temp);    
}
void TFT_18bit(void)
{
/*  00b: 24-bits output.
    01b: 18-bits output, unused pins are set as GPIO.
    10b: 16-bits output, unused pins are set as GPIO.
    11b: LVDS, all 24-bits unused output pins are set as GPIO.*/
	unsigned char temp;
	LCD_CmdWrite(0x01);
	temp = LCD_DataRead();
	temp &= cClrb4;
    temp |= cSetb3;
	LCD_DataWrite(temp);  
}
void TFT_16bit(void)
{
/*  00b: 24-bits output.
    01b: 18-bits output, unused pins are set as GPIO.
    10b: 16-bits output, unused pins are set as GPIO.
    11b: LVDS, all 24-bits unused output pins are set as GPIO.*/
	unsigned char temp;
	LCD_CmdWrite(0x01);
	temp = LCD_DataRead();
	temp |= cSetb4;
    temp &= cClrb3;
	LCD_DataWrite(temp);  
}
void TFT_LVDS(void)
{
/*  00b: 24-bits output.
    01b: 18-bits output, unused pins are set as GPIO.
    10b: 16-bits output, unused pins are set as GPIO.
    11b: LVDS, all 24-bits unused output pins are set as GPIO.*/
	unsigned char temp;
	LCD_CmdWrite(0x01);
	temp = LCD_DataRead();
	temp |= cSetb4;
    temp |= cSetb3;
	LCD_DataWrite(temp);  
}

void Enable_SFlash_SPI(void)
{
/*  Serial Flash SPI Interface Enable/Disable
    0: Disable
    1: Enable*/
	unsigned char temp;
	LCD_CmdWrite(0x01);
	temp = LCD_DataRead();
	temp |= cSetb1;
	LCD_DataWrite(temp);
}

void Disable_SFlash_SPI(void)
{
/*  Serial Flash SPI Interface Enable/Disable
    0: Disable
    1: Enable*/
	unsigned char temp;
	LCD_CmdWrite(0x01);
	temp = LCD_DataRead();
	temp &= cClrb1;
	LCD_DataWrite(temp);     
}


void Host_Bus_8bit(void)
{
/*  Parallel Host Data Bus Width Selection
    0: 8-bit Parallel Host Data Bus.
    1: 16-bit Parallel Host Data Bus.*/
	unsigned char temp;
	LCD_CmdWrite(0x01);
	temp = LCD_DataRead();
	temp &= cClrb0;
	LCD_DataWrite(temp);
}
void Host_Bus_16bit(void)
{
/*  Parallel Host Data Bus Width Selection
    0: 8-bit Parallel Host Data Bus.
    1: 16-bit Parallel Host Data Bus.*/
	unsigned char temp;
	LCD_CmdWrite(0x01);
	temp = LCD_DataRead();
	temp |= cSetb0;
	LCD_DataWrite(temp);
}

//[02h][02h][02h][02h][02h][02h][02h][02h][02h][02h][02h][02h][02h][02h][02h][02h]

