Yoda49/RA8876-Driver-for-STM32F429ZIT6-FMC/RA8876_driver.c
//[0Ch]=========================================================================
unsigned char Read_Interrupt_status(void)
{
	/*
	[Bit7]Read Function ..Resume Interrupt Status
	0: No Resume interrupt happens.
	1: Resume interrupt happens.
	[Bit6]Read Function .. PS[0] pin Interrupt Status
	0: No PS[0] pin interrupt happens.
	1: PS[0] pin interrupt happens.
	[Bit5]Read Function .. I2C master Interrupt Status
	0: No I2C master interrupt happens.
	1: I2C master interrupt happens.
	[Bit4]Read Function .. Vsync Interrupt Status
	0: No interrupt happens.
	1: interrupt happens.
	[Bit3]Read Function ..Key Scan Interrupt Status
	0: No Key Scan interrupt happens.
	1: Key Scan interrupt happens.
	[Bit2]Read Function..Interrupt Status
	0: No interrupt happens.
	1: interrupt happens.
	[Bit1]Read Function..Interrupt Status
	0: No interrupt happens.
	1: interrupt happens.
	[Bit0]Read Function..Interrupt Status
	0: No interrupt happens.
	1: interrupt happens.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x0C);
	temp = LCD_DataRead();
    return temp;
}
void Clear_Resume_Interrupt_Flag(void)
{
	/*
	Resume Interrupt flag
	Write Function .. Resume Interrupt Clear Bit
	0: No operation.
	1: Clear Resume interrupt.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x0C);
	temp = LCD_DataRead();
    temp |= cSetb7;
	LCD_DataWrite(temp);
}
void Clear_ExtInterrupt_Input_Flag(void)
{
	/*
	External Interrupt (PS[0] pin) flag
	Write Function .. PS[0] pin edge Interrupt Clear Bit
	0: No operation.
	1: Clear the PS[0] pin edge interrupt.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x0C);
	temp = LCD_DataRead();
    temp |= cSetb6;
	LCD_DataWrite(temp);
}

void Clear_Vsync_Interrupt_Flag(void)
{
	/*
	Vsync Time base interrupt flag
	Write Function ..Vsync Interrupt Clear Bit
	0: No operation.
	1: Clear the interrupt.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x0C);
	temp = LCD_DataRead();
    temp |= cSetb4;
	LCD_DataWrite(temp);
}

void Clear_DMA_Draw_BTE_Interrupt_Flag(void)
{
	/*
	Serial flash DMA Complete | Draw task finished | BTE
	Process Complete etc. Interrupt flag
	Write Function.. Interrupt Clear Bit
	0: No operation.
	1: Clear interrupt.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x0C);
	temp = LCD_DataRead();
    temp |= cSetb2;
	LCD_DataWrite(temp);
}


//[0Dh]=========================================================================
void Mask_Resume_Interrupt_Flag(void)
{
	/*
	Mask Resume Interrupt Flag
	0: Enable.
	1: Mask.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x0D);
	temp = LCD_DataRead();
    temp |= cSetb7;
	LCD_DataWrite(temp);
}
void Mask_ExtInterrupt_Input_Flag(void)
{
	/*
	Mask External Interrupt (PS[0] pin) Flag
	0: Enable.
	1: Mask.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x0D);
	temp = LCD_DataRead();
    temp |= cSetb6;
	LCD_DataWrite(temp);
}

void Mask_Vsync_Interrupt_Flag(void)
{
	/*
	Mask Vsync time base interrupt Flag
	0: Enable.
	1: Mask.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x0D);
	temp = LCD_DataRead();
    temp |= cSetb4;
	LCD_DataWrite(temp);
}

void Mask_DMA_Draw_BTE_Interrupt_Flag(void)
{
	/*
	Mask Serial flash DMA Complete | Draw task finished | BTE
	Process Complete etc. Interrupt Flag
	0: Enable.
	1: Mask.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x0D);
	temp = LCD_DataRead();
    temp |= cSetb2;
	LCD_DataWrite(temp);
}


void Enable_Resume_Interrupt_Flag(void)
{
	/*
	Mask Resume Interrupt Flag
	0: Enable.
	1: Mask.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x0D);
	temp = LCD_DataRead();
    temp &= cClrb7;
	LCD_DataWrite(temp);
}
void Enable_ExtInterrupt_Inpur_Flag(void)
{
	/*
	Mask External Interrupt (PS[0] pin) Flag
	0: Enable.
	1: Mask.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x0D);
	temp = LCD_DataRead();
    temp &= cClrb6;
	LCD_DataWrite(temp);
}

void Enable_Vsync_Interrupt_Flag(void)
{
	/*
	Mask Vsync time base interrupt Flag
	0: Enable.
	1: Mask.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x0D);
	temp = LCD_DataRead();
    temp &= cClrb4;
	LCD_DataWrite(temp);
}

void Enable_DMA_Draw_BTE_Interrupt_Flag(void)
{
	/*
	Mask Serial flash DMA Complete | Draw task finished | BTE
	Process Complete etc. Interrupt Flag
	0: Enable.
	1: Mask.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x0D);
	temp = LCD_DataRead();
    temp &= cClrb2;
	LCD_DataWrite(temp);
}




//[10h]=========================================================================
void Enable_PIP1(void)
{
	/*
	PIP 1 window Enable/Disable
	0 : PIP 1 window disable.
	1 : PIP 1 window enable
	PIP 1 window always on top of PIP 2 window.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x10);
	temp = LCD_DataRead();
    temp |= cSetb7;
	LCD_DataWrite(temp);
}
void Disable_PIP1(void)
{
	/*
	PIP 1 window Enable/Disable
	0 : PIP 1 window disable.
	1 : PIP 1 window enable
	PIP 1 window always on top of PIP 2 window.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x10);
	temp = LCD_DataRead();
    temp &= cClrb7;
	LCD_DataWrite(temp);
}
void Enable_PIP2(void)
{
	/*
	PIP 2 window Enable/Disable
	0 : PIP 2 window disable.
	1 : PIP 2 window enable
	PIP 1 window always on top of PIP 2 window.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x10);
	temp = LCD_DataRead();
    temp |= cSetb6;
	LCD_DataWrite(temp);
}
void Disable_PIP2(void)
{
	/*
	PIP 2 window Enable/Disable
	0 : PIP 2 window disable.
	1 : PIP 2 window enable
	PIP 1 window always on top of PIP 2 window.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x10);
	temp = LCD_DataRead();
    temp &= cClrb6;
	LCD_DataWrite(temp);
}
void Select_PIP1_Parameter(void)
{
	/*
	0: To configure PIP 1’s parameters.
	1: To configure PIP 2’s parameters..
	*/
	unsigned char temp;
	LCD_CmdWrite(0x10);
	temp = LCD_DataRead();
    temp &= cClrb4;
	LCD_DataWrite(temp);
}
void Select_PIP2_Parameter(void)
{
	/*
	0: To configure PIP 1’s parameters.
	1: To configure PIP 2’s parameters..
	*/
	unsigned char temp;
	LCD_CmdWrite(0x10);
	temp = LCD_DataRead();
    temp |= cSetb4;
	LCD_DataWrite(temp);
}
void Frame_Buffer_Color_Mode_8bpp(void)
{
	/*
	Main Window Color Depth Setting
	00b: 8-bpp generic TFT, i.e. 256 colors.
	01b: 16-bpp generic TFT, i.e. 65K colors.
	1xb: 24-bpp generic TFT, i.e. 1.67M colors.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x10);
	temp = LCD_DataRead();
    temp &= cClrb3;
    temp &= cClrb2;
	LCD_DataWrite(temp);
}
void Frame_Buffer_Color_Mode_16bpp(void)
{
	/*
	Main Window Color Depth Setting
	00b: 8-bpp generic TFT, i.e. 256 colors.
	01b: 16-bpp generic TFT, i.e. 65K colors.
	1xb: 24-bpp generic TFT, i.e. 1.67M colors.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x10);
	temp = LCD_DataRead();
    temp &= cClrb3;
    temp |= cSetb2;
	LCD_DataWrite(temp);
}
void Frame_Buffer_Color_Mode_24bpp(void)
{
	/*
	Main Window Color Depth Setting
	00b: 8-bpp generic TFT, i.e. 256 colors.
	01b: 16-bpp generic TFT, i.e. 65K colors.
	1xb: 24-bpp generic TFT, i.e. 1.67M colors.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x10);
	temp = LCD_DataRead();
    temp |= cSetb3;
    //temp |= cSetb2;
	LCD_DataWrite(temp);
}
//[11h]=========================================================================
void Select_PIP2_Window_8bpp(void)
{
	/*
	PIP 1 Window Color Depth Setting
	00b: 8-bpp generic TFT, i.e. 256 colors.
	01b: 16-bpp generic TFT, i.e. 65K colors.
	1xb: 24-bpp generic TFT, i.e. 1.67M colors.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x11);
	temp = LCD_DataRead();
    temp &= cClrb1;
    temp &= cClrb0;
	LCD_DataWrite(temp);
}

void Select_PIP2_Window_16bpp(void)
{
	/*
	PIP 1 Window Color Depth Setting
	00b: 8-bpp generic TFT, i.e. 256 colors.
	01b: 16-bpp generic TFT, i.e. 65K colors.
	1xb: 24-bpp generic TFT, i.e. 1.67M colors.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x11);
	temp = LCD_DataRead();
    temp &= cClrb1;
    temp |= cSetb0;
	LCD_DataWrite(temp);
}
void Select_PIP2_Window_24bpp(void)
{
	/*
	PIP 1 Window Color Depth Setting
	00b: 8-bpp generic TFT, i.e. 256 colors.
	01b: 16-bpp generic TFT, i.e. 65K colors.
	1xb: 24-bpp generic TFT, i.e. 1.67M colors.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x11);
	temp = LCD_DataRead();
    temp |= cSetb1;
    temp &= cClrb0;
	LCD_DataWrite(temp);
}
void Select_PIP1_Window_8bpp(void)
{
	/*
	PIP 2 Window Color Depth Setting
	00b: 8-bpp generic TFT, i.e. 256 colors.
	01b: 16-bpp generic TFT, i.e. 65K colors.
	1xb: 24-bpp generic TFT, i.e. 1.67M colors.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x11);
	temp = LCD_DataRead();
    temp &= cClrb3;
    temp &= cClrb2;
	LCD_DataWrite(temp);
}
void Select_PIP1_Window_16bpp(void)
{
	/*
	PIP 2 Window Color Depth Setting
	00b: 8-bpp generic TFT, i.e. 256 colors.
	01b: 16-bpp generic TFT, i.e. 65K colors.
	1xb: 24-bpp generic TFT, i.e. 1.67M colors.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x11);
	temp = LCD_DataRead();
    temp &= cClrb3;
    temp |= cSetb2;
	LCD_DataWrite(temp);
}
void Select_PIP1_Window_24bpp(void)
{
	/*
	PIP 2 Window Color Depth Setting
	00b: 8-bpp generic TFT, i.e. 256 colors.
	01b: 16-bpp generic TFT, i.e. 65K colors.
	1xb: 24-bpp generic TFT, i.e. 1.67M colors.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x11);
	temp = LCD_DataRead();
    temp |= cSetb3;
    temp &= cClrb2;
	LCD_DataWrite(temp);
}

//[12h]=========================================================================
void PCLK_Rising(void)	 
{
	/*
	PCLK Inversion
	0: PDAT, DE, HSYNC etc. Drive(/ change) at PCLK falling edge.
	1: PDAT, DE, HSYNC etc. Drive(/ change) at PCLK rising edge.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x12);
	temp = LCD_DataRead();
    temp &= cClrb7;
	LCD_DataWrite(temp);
}
void PCLK_Falling(void)
{
	/*
	PCLK Inversion
	0: PDAT, DE, HSYNC etc. Drive(/ change) at PCLK falling edge.
	1: PDAT, DE, HSYNC etc. Drive(/ change) at PCLK rising edge.
	*/
	unsigned char temp;
	LCD_CmdWrite(0x12);
	temp = LCD_DataRead();
    temp |= cSetb7;
	LCD_DataWrite(temp);
}
void Display_ON(void)
{
	/*	
	Display ON/OFF
	0b: Display Off.
	1b: Display On.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x12);
	temp = LCD_DataRead();
	temp |= cSetb6;
	LCD_DataWrite(temp);
}

