Yoda49/RA8876-Driver-for-STM32F429ZIT6-FMC/RA8876_driver.c
void Display_OFF(void)
{
	/*	
	Display ON/OFF
	0b: Display Off.
	1b: Display On.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x12);
	temp = LCD_DataRead();
	temp &= cClrb6;
	LCD_DataWrite(temp);
}
void Color_Bar_ON(void)
{
	/*	
	Display Test Color Bar
	0b: Disable.
	1b: Enable.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x12);
	temp = LCD_DataRead();
	temp |= cSetb5;
	LCD_DataWrite(temp);
}
void Color_Bar_OFF(void)
{
	/*	
	Display Test Color Bar
	0b: Disable.
	1b: Enable.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x12);
	temp = LCD_DataRead();
	temp &= cClrb5;
	LCD_DataWrite(temp);
}
void HSCAN_L_to_R(void)
{
	/*	
	Horizontal Scan Direction
	0 : From Left to Right
	1 : From Right to Left
	PIP window will be disabled when HDIR set as 1.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x12);
	temp = LCD_DataRead();
	temp &= cClrb4;
	LCD_DataWrite(temp);
}
void HSCAN_R_to_L(void)
{
	/*	
	Horizontal Scan Direction
	0 : From Left to Right
	1 : From Right to Left
	PIP window will be disabled when HDIR set as 1.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x12);
	temp = LCD_DataRead();
	temp |= cSetb4;
	LCD_DataWrite(temp);
}
void VSCAN_T_to_B(void)
{
	/*	
	Vertical Scan direction
	0 : From Top to Bottom
	1 : From bottom to Top
	PIP window will be disabled when VDIR set as 1.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x12);
	temp = LCD_DataRead();
	temp &= cClrb3;
	LCD_DataWrite(temp);
}
void VSCAN_B_to_T(void)
{
	/*	
	Vertical Scan direction
	0 : From Top to Bottom
	1 : From bottom to Top
	PIP window will be disabled when VDIR set as 1.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x12);
	temp = LCD_DataRead();
	temp |= cSetb3;
	LCD_DataWrite(temp);
}
void PDATA_Set_RGB(void)
{
	/*	
	parallel PDATA[23:0] Output Sequence
	000b : RGB.
	001b : RBG.
	010b : GRB.
	011b : GBR.
	100b : BRG.
	101b : BGR.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x12);
	temp = LCD_DataRead();
    temp &=0xf8;
	LCD_DataWrite(temp);
}
void PDATA_Set_RBG(void)
{
	/*	
	parallel PDATA[23:0] Output Sequence
	000b : RGB.
	001b : RBG.
	010b : GRB.
	011b : GBR.
	100b : BRG.
	101b : BGR.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x12);
	temp = LCD_DataRead();
	temp &=0xf8;
    temp |= cSetb0;
	LCD_DataWrite(temp);
}
void PDATA_Set_GRB(void)
{
	/*	
	parallel PDATA[23:0] Output Sequence
	000b : RGB.
	001b : RBG.
	010b : GRB.
	011b : GBR.
	100b : BRG.
	101b : BGR.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x12);
	temp = LCD_DataRead();
	temp &=0xf8;
    temp |= cSetb1;
	LCD_DataWrite(temp);
}
void PDATA_Set_GBR(void)
{
	/*	
	parallel PDATA[23:0] Output Sequence
	000b : RGB.
	001b : RBG.
	010b : GRB.
	011b : GBR.
	100b : BRG.
	101b : BGR.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x12);
	temp = LCD_DataRead();
	temp &=0xf8;
    temp |= cSetb1;
    temp |= cSetb0;
	LCD_DataWrite(temp);
}
void PDATA_Set_BRG(void)
{
	/*	
	parallel PDATA[23:0] Output Sequence
	000b : RGB.
	001b : RBG.
	010b : GRB.
	011b : GBR.
	100b : BRG.
	101b : BGR.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x12);
	temp = LCD_DataRead();
	temp &=0xf8;
	temp |= cSetb2;
	LCD_DataWrite(temp);
}
void PDATA_Set_BGR(void)
{
	/*	
	parallel PDATA[23:0] Output Sequence
	000b : RGB.
	001b : RBG.
	010b : GRB.
	011b : GBR.
	100b : BRG.
	101b : BGR.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x12);
	temp = LCD_DataRead();
	temp &=0xf8;
	temp |= cSetb2;
    temp |= cSetb0;
	LCD_DataWrite(temp);
}

void PDATA_IDLE_STATE(void)
{
	unsigned char temp;
	
	LCD_CmdWrite(0x12);
	temp = LCD_DataRead();
	temp |=0x07;
	LCD_DataWrite(temp);

}


//[13h]=========================================================================
void HSYNC_Low_Active(void)
{
	/*	
	HSYNC Polarity
	0 : Low active.
	1 : High active.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x13);
	temp = LCD_DataRead();
	temp &= cClrb7;
	LCD_DataWrite(temp);
}
void HSYNC_High_Active(void)
{
	/*	
	HSYNC Polarity
	0 : Low active.
	1 : High active.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x13);
	temp = LCD_DataRead();	 
	temp |= cSetb7;
	LCD_DataWrite(temp);
}
void VSYNC_Low_Active(void)
{
	/*	
	VSYNC Polarity
	0 : Low active.
	1 : High active.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x13);
	temp = LCD_DataRead();
	temp &= cClrb6;	
	LCD_DataWrite(temp);
}
void VSYNC_High_Active(void)
{
	/*	
	VSYNC Polarity
	0 : Low active.
	1 : High active.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x13);
	temp = LCD_DataRead();
	temp |= cSetb6;
	LCD_DataWrite(temp);
}
void DE_Low_Active(void)
{
	/*	
	DE Polarity
	0 : High active.
	1 : Low active.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x13);
	temp = LCD_DataRead();
    temp |= cSetb5;
	LCD_DataWrite(temp);
}
void DE_High_Active(void)
{
	/*	
	DE Polarity
	0 : High active.
	1 : Low active.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x13);
	temp = LCD_DataRead();
	temp &= cClrb5;
	LCD_DataWrite(temp);
}
void Idle_DE_Low(void)
{
	/*	
	DE IDLE STATE(When STANDBY or DISPLAY OFF )
	0 : Pin “DE” output is low.
	1 : Pin “DE” output is high.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x13);
	temp = LCD_DataRead();
    temp &= cClrb4;
	LCD_DataWrite(temp);
}
void Idle_DE_High(void)
{
	/*	
	DE IDLE STATE(When STANDBY or DISPLAY OFF )
	0 : Pin “DE” output is low.
	1 : Pin “DE” output is high.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x13);
	temp = LCD_DataRead();
	temp |= cSetb4;
	LCD_DataWrite(temp);
}
void Idle_PCLK_Low(void)
{
	/*	
	PCLK IDLE STATE(When STANDBY or DISPLAY OFF )
	0 : Pin “PCLK” output is low.
	1 : Pin “PCLK” output is high.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x13);
	temp = LCD_DataRead();
    temp &= cClrb3;
	LCD_DataWrite(temp);
}
void Idle_PCLK_High(void)
{
	/*	
	PCLK IDLE STATE(When STANDBY or DISPLAY OFF )
	0 : Pin “PCLK” output is low.
	1 : Pin “PCLK” output is high.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x13);
	temp = LCD_DataRead();
	temp |= cSetb3;
	LCD_DataWrite(temp);
}
void Idle_PDAT_Low(void)
{
	/*	
	PDAT IDLE STATE(When STANDBY or DISPLAY OFF )
	0 : Pins “PDAT[23:0]” output is low.
	1 : Pins “PCLK[23:0]” output is high.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x13);
	temp = LCD_DataRead();
    temp &= cClrb2;
	LCD_DataWrite(temp);
}
void Idle_PDAT_High(void)
{
	/*	
	PDAT IDLE STATE(When STANDBY or DISPLAY OFF )
	0 : Pins “PDAT[23:0]” output is low.
	1 : Pins “PCLK[23:0]” output is high.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x13);
	temp = LCD_DataRead();
	temp |= cSetb2;
	LCD_DataWrite(temp);
}
void Idle_HSYNC_Low(void)
{
	/*	
	HSYNC IDLE STATE(When STANDBY or DISPLAY OFF )
	0 : Pin “HSYNC” output is low.
	1 : Pin “HSYNC” output is high.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x13);
	temp = LCD_DataRead();
    temp &= cClrb1;
	LCD_DataWrite(temp);
}
void Idle_HSYNC_High(void)
{
	/*	
	HSYNC IDLE STATE(When STANDBY or DISPLAY OFF )
	0 : Pin “HSYNC” output is low.
	1 : Pin “HSYNC” output is high.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x13);
	temp = LCD_DataRead();
	temp |= cSetb1;
	LCD_DataWrite(temp);
}
void Idle_VSYNC_Low(void)
{
	/*	
	VSYNC IDLE STATE(When STANDBY or DISPLAY OFF )
	0 : Pin “VSYNC” output is low.
	1 : Pin “VSYNC” output is high.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x13);
	temp = LCD_DataRead();
    temp &= cClrb0;
	LCD_DataWrite(temp);
}
void Idle_VSYNC_High(void)
{
	/*	
	VSYNC IDLE STATE(When STANDBY or DISPLAY OFF )
	0 : Pin “VSYNC” output is low.
	1 : Pin “VSYNC” output is high.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x13);
	temp = LCD_DataRead();
	temp |= cSetb0;
	LCD_DataWrite(temp);
}

//[14h][15h][1Ah][1Bh]=========================================================================
void LCD_HorizontalWidth_VerticalHeight(unsigned short WX,unsigned short HY)
{
	/*
	[14h] Horizontal Display Width Setting Bit[7:0]
	[15h] Horizontal Display Width Fine Tuning (HDWFT) [3:0]
	The register specifies the LCD panel horizontal display width in
	the unit of 8 pixels resolution.
	Horizontal display width(pixels) = (HDWR + 1) * 8 + HDWFTR

