Yoda49/RA8876-Driver-for-STM32F429ZIT6-FMC/RA8876_driver.c
	[1Ah] Vertical Display Height Bit[7:0]
	Vertical Display Height(Line) = VDHR + 1
	[1Bh] Vertical Display Height Bit[10:8]
	Vertical Display Height(Line) = VDHR + 1
	*/
	unsigned char temp;
	if(WX < 8)
    {
		LCD_CmdWrite(0x14);
		LCD_DataWrite(0x00);
		
		LCD_CmdWrite(0x15);
		LCD_DataWrite(WX);
		
		temp = HY - 1;
		LCD_CmdWrite(0x1A);
		LCD_DataWrite(temp);
			
		temp = (HY - 1) >> 8;
		LCD_CmdWrite(0x1B);
		LCD_DataWrite(temp);
	}
	else
	{
		temp = (WX / 8) - 1;
		LCD_CmdWrite(0x14);
		LCD_DataWrite(temp);
		
		temp = WX % 8;
		LCD_CmdWrite(0x15);
		LCD_DataWrite(temp);
		
		temp = HY - 1;
		LCD_CmdWrite(0x1A);
		LCD_DataWrite(temp);
			
		temp = (HY - 1) >> 8;
		LCD_CmdWrite(0x1B);
		LCD_DataWrite(temp);
	}
}
//[16h][17h]=========================================================================
void LCD_Horizontal_Non_Display(unsigned short WX)
{
	/*
	[16h] Horizontal Non-Display Period(HNDR) Bit[4:0]
	This register specifies the horizontal non-display period. Also
	called back porch.
	Horizontal non-display period(pixels) = (HNDR + 1) * 8 + HNDFTR

	[17h] Horizontal Non-Display Period Fine Tuning(HNDFT) [3:0]
	This register specifies the fine tuning for horizontal non-display
	period; it is used to support the SYNC mode panel. Each level of
	this modulation is 1-pixel.
	Horizontal non-display period(pixels) = (HNDR + 1) * 8 + HNDFTR
	*/
	unsigned char temp;
	if(WX < 8)
	{
		LCD_CmdWrite(0x16);
		LCD_DataWrite(0x00);
		
		LCD_CmdWrite(0x17);
		LCD_DataWrite(WX);
	}
	else
	{
		temp = (WX / 8) - 1;
		LCD_CmdWrite(0x16);
		LCD_DataWrite(temp);
		
		temp = WX % 8;
		LCD_CmdWrite(0x17);
		LCD_DataWrite(temp);
	}	
}
//[18h]=========================================================================
void LCD_HSYNC_Start_Position(unsigned short WX)
{
	/*
	[18h] HSYNC Start Position[4:0]
	The starting position from the end of display area to the
	beginning of HSYNC. Each level of this modulation is 8-pixel.
	Also called front porch.
	HSYNC Start Position(pixels) = (HSTR + 1)x8
	*/
	
	unsigned char temp;
	if(WX < 8)
	{
		LCD_CmdWrite(0x18);
		LCD_DataWrite(0x00);
	}
	else
	{
		temp = (WX / 8) - 1;
		LCD_CmdWrite(0x18);
		LCD_DataWrite(temp);	
	}
}
//[19h]=========================================================================
void LCD_HSYNC_Pulse_Width(unsigned short WX)
{
	/*
	[19h] HSYNC Pulse Width(HPW) [4:0]
	The period width of HSYNC.
	HSYNC Pulse Width(pixels) = (HPW + 1)x8
	*/
	unsigned char temp;
	if(WX < 8)
	{
		LCD_CmdWrite(0x19);
		LCD_DataWrite(0x00);
	}
	else
	{
		temp = (WX / 8) - 1;
		LCD_CmdWrite(0x19);
		LCD_DataWrite(temp);	
	}
}
//[1Ch][1Dh]=========================================================================
void LCD_Vertical_Non_Display(unsigned short HY)
{
	/*
	[1Ch] Vertical Non-Display Period Bit[7:0]
	Vertical Non-Display Period(Line) = (VNDR + 1)

	[1Dh] Vertical Non-Display Period Bit[9:8]
	Vertical Non-Display Period(Line) = (VNDR + 1)
	*/
	unsigned char temp;
    temp = HY - 1;
	LCD_CmdWrite(0x1C);
	LCD_DataWrite(temp);

	LCD_CmdWrite(0x1D);
	LCD_DataWrite(temp >> 8);
}
//[1Eh]=========================================================================
void LCD_VSYNC_Start_Position(unsigned short HY)
{
	/*
	[1Eh] VSYNC Start Position[7:0]
	The starting position from the end of display area to the beginning of VSYNC.
	VSYNC Start Position(Line) = (VSTR + 1)
	*/
	unsigned char temp;
    temp = HY - 1;
	LCD_CmdWrite(0x1E);
	LCD_DataWrite(temp);
}
//[1Fh]=========================================================================
void LCD_VSYNC_Pulse_Width(unsigned short HY)
{
	/*
	[1Fh] VSYNC Pulse Width[5:0]
	The pulse width of VSYNC in lines.
	VSYNC Pulse Width(Line) = (VPWR + 1)
	*/
	unsigned char temp;
    temp = HY - 1;
	LCD_CmdWrite(0x1F);
	LCD_DataWrite(temp);
}

void Frame_Buffer_Switch (unsigned long addr)
{
	// CONFIGURE DISPLAY FRAME BUFFER
	Frame_Buffer_Start_Address(addr);
	Frame_Buffer_Width(1024);
	Frame_Buffer_Start_XY(0,0);
	Frame_Buffer_Color_Mode_16bpp();
}

//[20h][21h][22h][23h]=========================================================================
void Frame_Buffer_Start_Address(unsigned long Addr)	
{
	/*
	[20h] Main Image Start Address[7:2]
	[21h] Main Image Start Address[15:8]
	[22h] Main Image Start Address [23:16]
	[23h] Main Image Start Address [31:24]
	*/
	LCD_RegisterWrite(0x20, Addr);
	LCD_RegisterWrite(0x21, Addr >> 8);
	LCD_RegisterWrite(0x22, Addr >> 16);
	LCD_RegisterWrite(0x23, Addr >> 24);
}

//[24h][25h]=========================================================================
void Frame_Buffer_Width(unsigned short WX)	
{
	/*
	[24h] Main Image Width [7:0]
	[25h] Main Image Width [12:8]
	Unit: Pixel.
	It must be divisible by 4. MIW Bit [1:0] tie to “0” internally.
	The value is physical pixel number. Maximum value is 8188 pixels
	*/
	LCD_RegisterWrite(0x24, WX);
	LCD_RegisterWrite(0x25, WX >> 8);
}

//[26h][27h][28h][29h]=========================================================================
void Frame_Buffer_Start_XY(unsigned short WX,unsigned short HY)	
{
	/*
	[26h] Main Window Upper-Left corner X-coordination [7:0]
	[27h] Main Window Upper-Left corner X-coordination [12:8]
	Reference Main Image coordination.
	Unit: Pixel
	It must be divisible by 4. MWULX Bit [1:0] tie to “0” internally.
	X-axis coordination plus Horizontal display width cannot large than 8188.

	[28h] Main Window Upper-Left corner Y-coordination [7:0]
	[29h] Main Window Upper-Left corner Y-coordination [12:8]
	Reference Main Image coordination.
	Unit: Pixel
	Range is between 0 and 8191.
	*/
	LCD_RegisterWrite(0x26, WX);
	LCD_RegisterWrite(0x27, WX >> 8);

	LCD_RegisterWrite(0x28, HY);
	LCD_RegisterWrite(0x29, HY >> 8);
}
//[2Ah][2Bh][2Ch][2Dh]=========================================================================
void PIP_Display_Start_XY(unsigned short WX,unsigned short HY)	
{
	/*
	[2Ah] PIP Window Display Upper-Left corner X-coordination [7:0]
	[2Bh] PIP Window Display Upper-Left corner X-coordination [12:8]
	Reference Main Window coordination.
	Unit: Pixel
	It must be divisible by 4. PWDULX Bit [1:0] tie to “0” internally.
	X-axis coordination should less than horizontal display width.
	According to bit of Select Configure PIP 1 or 2 Window’s parameters. 
	Function bit will be configured for relative PIP window.

	[2Ch] PIP Window Display Upper-Left corner Y-coordination [7:0]
	[2Dh] PIP Window Display Upper-Left corner Y-coordination [12:8]
	Reference Main Window coordination.
	Unit: Pixel
	Y-axis coordination should less than vertical display height.
	According to bit of Select Configure PIP 1 or 2 Window’s parameters.
	Function bit will be configured for relative PIP window.
	*/
	LCD_RegisterWrite(0x2A, WX);
	LCD_RegisterWrite(0x2B, WX >> 8);
	
	LCD_RegisterWrite(0x2C, HY);
	LCD_RegisterWrite(0x2D, HY >> 8);
}
//[2Eh][2Fh][30h][31h]=========================================================================
void PIP_Image_Start_Address(unsigned long Addr)	
{
	/*
	[2Eh] PIP Image Start Address[7:2]
	[2Fh] PIP Image Start Address[15:8]
	[30h] PIP Image Start Address [23:16]
	[31h] PIP Image Start Address [31:24]
	*/
	LCD_RegisterWrite(0x2E, Addr);
	LCD_RegisterWrite(0x2F, Addr >> 8);
	LCD_RegisterWrite(0x30, Addr >> 16);
	LCD_RegisterWrite(0x31, Addr >> 24);
}
//[32h][33h]=========================================================================
void PIP_Image_Width(unsigned short WX)	
{
	/*
	[32h] PIP Image Width [7:0]
	[33h] PIP Image Width [12:8]
	Unit: Pixel.
	It must be divisible by 4. PIW Bit [1:0] tie to “0” internally.
	The value is physical pixel number.
	This width should less than horizontal display width.
	According to bit of Select Configure PIP 1 or 2 Window’s parameters.
	Function bit will be configured for relative PIP window.
	*/
	LCD_RegisterWrite(0x32, WX);
	LCD_RegisterWrite(0x33, WX >> 8);
}
//[34h][35h][36h][37h]=========================================================================
void PIP_Window_Image_Start_XY(unsigned short WX,unsigned short HY)	
{
	/*
	[34h] PIP 1 or 2 Window Image Upper-Left corner X-coordination [7:0]
	[35h] PIP Window Image Upper-Left corner X-coordination [12:8]
	Reference PIP Image coordination.
	Unit: Pixel
	It must be divisible by 4. PWIULX Bit [1:0] tie to “0” internally.
	X-axis coordination plus PIP image width cannot large than 8188.
	According to bit of Select Configure PIP 1 or 2 Window’s parameters. 
	Function bit will be configured for relative PIP window.

	[36h] PIP Windows Display Upper-Left corner Y-coordination [7:0]
	[37h] PIP Windows Image Upper-Left corner Y-coordination [12:8]
	Reference PIP Image coordination.
	Unit: Pixel
	Y-axis coordination plus PIP window height should less than 8191.
	According to bit of Select Configure PIP 1 or 2 Window’s parameters. 
	Function bit will be configured for relative PIP window.
	*/
	LCD_RegisterWrite(0x34, WX);
	LCD_RegisterWrite(0x35, WX >> 8);
	
	LCD_RegisterWrite(0x36, HY);
	LCD_RegisterWrite(0x37, HY >> 8);
}
//[38h][39h][3Ah][3Bh]=========================================================================
void PIP_Window_Width_Height(unsigned short WX,unsigned short HY)	
{
	/*
	[38h] PIP Window Width [7:0]
	[39h] PIP Window Width [10:8]
	Unit: Pixel.
	It must be divisible by 4. The value is physical pixel number.
	Maximum value is 8188 pixels.
	According to bit of Select Configure PIP 1 or 2 Window’s parameters. 
	Function bit will be configured for relative PIP window.

	[3Ah] PIP Window Height [7:0]
	[3Bh] PIP Window Height [10:8]
	Unit: Pixel
	The value is physical pixel number. Maximum value is 8191 pixels.
	According to bit of Select Configure PIP 1 or 2 Window’s parameters. 
	Function bit will be configured for relative PIP window.
	*/
	LCD_RegisterWrite(0x38, WX);
	LCD_RegisterWrite(0x39, WX >> 8);
	
	LCD_RegisterWrite(0x3A, HY);
	LCD_RegisterWrite(0x3B, HY >> 8);
}

//[3Ch]=========================================================================
void Enable_Graphic_Cursor(void)	
{
	/*
	Graphic Cursor Enable
	0 : Graphic Cursor disable.
	1 : Graphic Cursor enable.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x3C);
	temp = LCD_DataRead();
	temp |= cSetb4;
	LCD_DataWrite(temp);
}
void Disable_Graphic_Cursor(void)	
{
	/*
	Graphic Cursor Enable
	0 : Graphic Cursor disable.
	1 : Graphic Cursor enable.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x3C);
	temp = LCD_DataRead();
	temp &= cClrb4;
	LCD_DataWrite(temp);
}

