Yoda49/RA8876-Driver-for-STM32F429ZIT6-FMC/RA8876_driver.c
void Select_Graphic_Cursor_1(void)	
{
	/*
	Graphic Cursor Selection Bit
	Select one from four graphic cursor types. (00b to 11b)
	00b : Graphic Cursor Set 1.
	01b : Graphic Cursor Set 2.
	10b : Graphic Cursor Set 3.
	11b : Graphic Cursor Set 4.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x3C);
	temp = LCD_DataRead();
	temp &= cClrb3;
	temp &= cClrb2;
	LCD_DataWrite(temp);
}
void Select_Graphic_Cursor_2(void)	
{
	/*
	Graphic Cursor Selection Bit
	Select one from four graphic cursor types. (00b to 11b)
	00b : Graphic Cursor Set 1.
	01b : Graphic Cursor Set 2.
	10b : Graphic Cursor Set 3.
	11b : Graphic Cursor Set 4.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x3C);
	temp = LCD_DataRead();
	temp &= cClrb3;
	temp |= cSetb2;
	LCD_DataWrite(temp);
}
void Select_Graphic_Cursor_3(void)	
{
	/*
	Graphic Cursor Selection Bit
	Select one from four graphic cursor types. (00b to 11b)
	00b : Graphic Cursor Set 1.
	01b : Graphic Cursor Set 2.
	10b : Graphic Cursor Set 3.
	11b : Graphic Cursor Set 4.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x3C);
	temp = LCD_DataRead();
	temp |= cSetb3;
	temp &= cClrb2;
	LCD_DataWrite(temp);
}
void Select_Graphic_Cursor_4(void)	
{
	/*
	Graphic Cursor Selection Bit
	Select one from four graphic cursor types. (00b to 11b)
	00b : Graphic Cursor Set 1.
	01b : Graphic Cursor Set 2.
	10b : Graphic Cursor Set 3.
	11b : Graphic Cursor Set 4.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x3C);
	temp = LCD_DataRead();
	temp |= cSetb3;
	temp |= cSetb2;
	LCD_DataWrite(temp);
}
//
void Enable_Text_Cursor(void)	
{
	/*
	Text Cursor Enable
	0 : Disable.
	1 : Enable.
	Text cursor & Graphic cursor cannot enable simultaneously.
	Graphic cursor has higher priority then Text cursor if enabled simultaneously.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x3C);
	temp = LCD_DataRead();
	temp |= cSetb1;
	LCD_DataWrite(temp);
}
void Disable_Text_Cursor(void)	
{
	/*
	Text Cursor Enable
	0 : Disable.
	1 : Enable.
	Text cursor & Graphic cursor cannot enable simultaneously.
	Graphic cursor has higher priority then Text cursor if enabled simultaneously.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x3C);
	temp = LCD_DataRead();
	temp &= cClrb1;
	LCD_DataWrite(temp);
}
//
void Enable_Text_Cursor_Blinking(void)	
{
	/*
	Text Cursor Blinking Enable
	0 : Disable.
	1 : Enable.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x3C);
	temp = LCD_DataRead();
	temp |= cSetb0;
	LCD_DataWrite(temp);
}
void Disable_Text_Cursor_Blinking (void)	
{
	/*
	Text Cursor Blinking Enable
	0 : Disable.
	1 : Enable.
	*/
	unsigned char temp;
	
	LCD_CmdWrite(0x3C);
	temp = LCD_DataRead();
	temp &= cClrb0;
	LCD_DataWrite(temp);
}
//[3Dh]=========================================================================
void Blinking_Time_Frames (unsigned char temp)	
{
	/*
	Text Cursor Blink Time Setting (Unit: Frame)
	00h : 1 frame time.
	01h : 2 frames time.
	02h : 3 frames time.
	:
	FFh : 256 frames time.
	*/
	LCD_CmdWrite(0x3D);
	LCD_DataWrite(temp);
}
//[3Eh]=========================================================================
void Text_Cursor_H_V (unsigned short WX,unsigned short HY)
{
	/*
	[3Eh]
	Text Cursor Horizontal Size Setting[4:0]
	Unit : Pixel
	Zero-based number. Value “0” means 1 pixel.
	Note : When font is enlarged, the cursor setting will multiply the
	same times as the font enlargement.
	[3Fh]
	Text Cursor Vertical Size Setting[4:0]
	Unit : Pixel
	Zero-based number. Value “0” means 1 pixel.
	Note : When font is enlarged, the cursor setting will multiply the
	same times as the font enlargement.
	*/
	LCD_CmdWrite(0x3E);
	LCD_DataWrite(WX);
	LCD_CmdWrite(0x3F);
	LCD_DataWrite(HY);
}
//[40h][41h][42h][43h]=========================================================================
void Graphic_Cursor_XY (unsigned short WX,unsigned short HY)
{
	/*
	[40h] Graphic Cursor Horizontal Location[7:0]
	[41h] Graphic Cursor Horizontal Location[12:8]
	[42h] Graphic Cursor Vertical Location[7:0]
	[43h] Graphic Cursor Vertical Location[12:8]
	Reference main Window coordination.
	*/	
	LCD_RegisterWrite(0x40,WX);
	LCD_RegisterWrite(0x41,WX>>8);

	LCD_RegisterWrite(0x42,HY);
	LCD_RegisterWrite(0x43,HY>>8);
}
//[44h]=========================================================================
void Set_Graphic_Cursor_Color_1 (unsigned char temp)
{
	/*
	[44h] Graphic Cursor Color 0 with 256 Colors
	RGB Format [7:0] = RRRGGGBB.
	*/	
	LCD_RegisterWrite(0x44,temp);
}
//[45h]=========================================================================
void Set_Graphic_Cursor_Color_2 (unsigned char temp)
{
	/*
	[45h] Graphic Cursor Color 1 with 256 Colors
	RGB Format [7:0] = RRRGGGBB.
	*/	
	LCD_RegisterWrite(0x45,temp);
}


void Canvas_Window_Switch (unsigned long addr)
{
	// CONFIGURE CURRENT CANVAS
	Canvas_Window_Start_Address(addr);
	Canvas_Window_Width(1024);
	Canvas_Window_Start_XY(0,0);
	Canvas_Window_WH(1024,600);
	Canvas_Memory_XY_Mode();
	Canvas_Window_Color_Mode_16bpp();
}

//[50h][51h][52h][53h]=========================================================================
void Canvas_Window_Start_Address (unsigned long Addr)	
{
	/*
	[50h] Start address of Canvas [7:0]
	[51h] Start address of Canvas [15:8]
	[52h] Start address of Canvas [23:16]
	[53h] Start address of Canvas [31:24]
	*/
	LCD_RegisterWrite(0x50,Addr);
	LCD_RegisterWrite(0x51,Addr>>8);
	LCD_RegisterWrite(0x52,Addr>>16);
	LCD_RegisterWrite(0x53,Addr>>24);
}
//[54h][55h]=========================================================================
void Canvas_Window_Width (unsigned short WX)	
{
	/*
	[54h] Canvas image width [7:2]
	[55h] Canvas image width [12:8]
	*/
	LCD_RegisterWrite(0x54,WX);
	LCD_RegisterWrite(0x55,WX>>8);
}
//[56h][57h][58h][59h]=========================================================================
void Canvas_Window_Start_XY (unsigned short WX,unsigned short HY)	
{
	/*
	[56h] Active Window Upper-Left corner X-coordination [7:0]
	[57h] Active Window Upper-Left corner X-coordination [12:8]
	[58h] Active Window Upper-Left corner Y-coordination [7:0]
	[59h] Active Window Upper-Left corner Y-coordination [12:8]
	*/
	LCD_RegisterWrite(0x56,WX);
	LCD_RegisterWrite(0x57,WX>>8);
	
	LCD_RegisterWrite(0x58,HY);
	LCD_RegisterWrite(0x59,HY>>8);
}
//[5Ah][5Bh][5Ch][5Dh]=========================================================================
void Canvas_Window_WH (unsigned short WX,unsigned short HY)	
{
	/*
	[5Ah] Width of Active Window [7:0]
	[5Bh] Width of Active Window [12:8]
	[5Ch] Height of Active Window [7:0]
	[5Dh] Height of Active Window [12:8]
	*/
	LCD_RegisterWrite(0x5A,WX);
	LCD_RegisterWrite(0x5B,WX>>8);
 
 	LCD_RegisterWrite(0x5C,HY);
	LCD_RegisterWrite(0x5D,HY>>8);
}

void Canvas_Memory_XY_Mode (void)	
{
	/*
	Canvas addressing mode
	0: Block mode (X-Y coordination addressing)
	1: linear mode
	*/
	unsigned char temp;

	LCD_CmdWrite(0x5E);
	temp = LCD_DataRead();
	temp &= cClrb2;
	LCD_DataWrite(temp);
}
void Canvas_Memory_Linear_Mode (void)	
{
	/*
	Canvas addressing mode
	0: Block mode (X-Y coordination addressing)
	1: linear mode
	*/
	unsigned char temp;

	LCD_CmdWrite(0x5E);
	temp = LCD_DataRead();
	temp |= cSetb2;
	LCD_DataWrite(temp);
}

