Yoda49/RA8876-Driver-for-STM32F429ZIT6-FMC/RA8876_driver.c
void Canvas_Window_Color_Mode_8bpp (void)	
{
	/*
	Canvas image’s color depth & memory R/W data width
	In Block Mode:
	00: 8bpp
	01: 16bpp
	1x: 24bpp
	In Linear Mode:
	X0: 8-bits memory data read/write.
	X1: 16-bits memory data read/write
	*/
	unsigned char temp;

	LCD_CmdWrite(0x5E);
	temp = LCD_DataRead();
	temp &= cClrb1;
	temp &= cClrb0;
	LCD_DataWrite(temp);
}

void Canvas_Window_Color_Mode_16bpp (void)	
{
	/*
	Canvas image’s color depth & memory R/W data width
	In Block Mode:
	00: 8bpp
	01: 16bpp
	1x: 24bpp
	In Linear Mode:
	X0: 8-bits memory data read/write.
	X1: 16-bits memory data read/write
	*/
	unsigned char temp;

	LCD_CmdWrite(0x5E);
	temp = LCD_DataRead();
	temp &= cClrb1;
	temp |= cSetb0;
	LCD_DataWrite(temp);
}
void Canvas_Window_Color_Mode_24bpp (void)	
{
	/*
	Canvas image’s color depth & memory R/W data width
	In Block Mode:
	00: 8bpp
	01: 16bpp
	1x: 24bpp
	In Linear Mode:
	X0: 8-bits memory data read/write.
	X1: 16-bits memory data read/write
	*/
	unsigned char temp;

	LCD_CmdWrite(0x5E);
	temp = LCD_DataRead();
	temp |= cSetb1;
	temp |= cSetb0;
	LCD_DataWrite(temp);
}

//[5Fh][60h][61h][62h]=========================================================================
void Goto_Pixel_XY(unsigned short WX,unsigned short HY)	
{
	/*
	[Write]: Set Graphic Read/Write position
	[Read]: Current Graphic Read/Write position
	Read back is Read position or Write position depends on
	REG[5Eh] bit3, Select to read back Graphic Read/Write position.
	When DPRAM Linear mode:Graphic Read/Write Position [31:24][23:16][15:8][7:0]
	When DPRAM Active window mode:Graphic Read/Write 
	Horizontal Position [12:8][7:0], 
	Vertical Position [12:8][7:0].
	Reference Canvas image coordination. Unit: Pixel
	*/
	LCD_RegisterWrite(0x5F,WX);
	LCD_RegisterWrite(0x60,WX>>8);
	
	LCD_RegisterWrite(0x61,HY);
	LCD_RegisterWrite(0x62,HY>>8);
}

void Goto_Linear_Addr(unsigned long Addr)
{
	LCD_RegisterWrite(0x5F,Addr);
	LCD_RegisterWrite(0x60,Addr>>8); 
	LCD_RegisterWrite(0x61,Addr>>16);
	LCD_RegisterWrite(0x62,Addr>>24);
}


//[63h][64h][65h][66h]=========================================================================
void Goto_Text_XY(unsigned short WX,unsigned short HY)	
{
	/*
	Write: Set Text Write position
	Read: Current Text Write position
	Text Write X-coordination [12:8][7:0]
	Text Write Y-coordination [12:8][7:0]
	Reference Canvas image coordination.
	Unit: Pixel
	*/
	LCD_RegisterWrite(0x63,WX);
	LCD_RegisterWrite(0x64,WX>>8);
	
	LCD_RegisterWrite(0x65,HY);
	LCD_RegisterWrite(0x66,HY>>8);
}
//[67h]=========================================================================
/*
[bit7]Draw Line / Triangle Start Signal
Write Function
0 : Stop the drawing function.
1 : Start the drawing function.
Read Function
0 : Drawing function complete.
1 : Drawing function is processing.
[bit5]Fill function for Triangle Signal
0 : Non fill.
1 : Fill.
[bit1]Draw Triangle or Line Select Signal
0 : Draw Line
1 : Draw Triangle
*/
void Start_Line(void)
{
	LCD_CmdWrite(0x67);
	LCD_DataWrite(0x80);
	Check_Busy_Draw();
}
void Start_Triangle(void)
{
	LCD_CmdWrite(0x67);
	LCD_DataWrite(0x82);//B1000_0010
	Check_Busy_Draw();
}
void Start_Triangle_Fill(void)
{

	LCD_CmdWrite(0x67);
	LCD_DataWrite(0xA2);//B1010_0010
	Check_Busy_Draw();
}
//[68h][69h][6Ah][6Bh]=========================================================================
void Line_Start_XY(unsigned short WX,unsigned short HY)
{
	/*
	[68h] Draw Line/Square/Triangle Start X-coordination [7:0]
	[69h] Draw Line/Square/Triangle Start X-coordination [12:8]
	[6Ah] Draw Line/Square/Triangle Start Y-coordination [7:0]
	[6Bh] Draw Line/Square/Triangle Start Y-coordination [12:8]
	*/
	LCD_CmdWrite(0x68);
	LCD_DataWrite(WX);

	LCD_CmdWrite(0x69);
	LCD_DataWrite(WX>>8);

	LCD_CmdWrite(0x6A);
	LCD_DataWrite(HY);

	LCD_CmdWrite(0x6B);
	LCD_DataWrite(HY>>8);
}
//[6Ch][6Dh][6Eh][6Fh]=========================================================================
void Line_End_XY(unsigned short WX,unsigned short HY)
{
	/*
	[6Ch] Draw Line/Square/Triangle End X-coordination [7:0]
	[6Dh] Draw Line/Square/Triangle End X-coordination [12:8]
	[6Eh] Draw Line/Square/Triangle End Y-coordination [7:0]
	[6Fh] Draw Line/Square/Triangle End Y-coordination [12:8]
	*/
	LCD_CmdWrite(0x6C);
	LCD_DataWrite(WX);

	LCD_CmdWrite(0x6D);
	LCD_DataWrite(WX>>8);

	LCD_CmdWrite(0x6E);
	LCD_DataWrite(HY);

	LCD_CmdWrite(0x6F);
	LCD_DataWrite(HY>>8);
}
//[68h]~[73h]=========================================================================
void Triangle_Point1_XY(unsigned short WX,unsigned short HY)
{
	/*
	[68h] Draw Line/Square/Triangle Start X-coordination [7:0]
	[69h] Draw Line/Square/Triangle Start X-coordination [12:8]
	[6Ah] Draw Line/Square/Triangle Start Y-coordination [7:0]
	[6Bh] Draw Line/Square/Triangle Start Y-coordination [12:8]
	*/
	LCD_CmdWrite(0x68);
	LCD_DataWrite(WX);

	LCD_CmdWrite(0x69);
	LCD_DataWrite(WX>>8);

	LCD_CmdWrite(0x6A);
	LCD_DataWrite(HY);

	LCD_CmdWrite(0x6B);
	LCD_DataWrite(HY>>8);
}

void Triangle_Point2_XY(unsigned short WX,unsigned short HY)
{
	/*
	[6Ch] Draw Line/Square/Triangle End X-coordination [7:0]
	[6Dh] Draw Line/Square/Triangle End X-coordination [12:8]
	[6Eh] Draw Line/Square/Triangle End Y-coordination [7:0]
	[6Fh] Draw Line/Square/Triangle End Y-coordination [12:8]
	*/
	LCD_CmdWrite(0x6C);
	LCD_DataWrite(WX);

	LCD_CmdWrite(0x6D);
	LCD_DataWrite(WX>>8);

	LCD_CmdWrite(0x6E);
	LCD_DataWrite(HY);

	LCD_CmdWrite(0x6F);
	LCD_DataWrite(HY>>8);
}

void Triangle_Point3_XY (unsigned short WX,unsigned short HY)
{
	/*
	[70h] Draw Triangle Point 3 X-coordination [7:0]
	[71h] Draw Triangle Point 3 X-coordination [12:8]
	[72h] Draw Triangle Point 3 Y-coordination [7:0]
	[73h] Draw Triangle Point 3 Y-coordination [12:8]
	*/
	LCD_CmdWrite(0x70);
	LCD_DataWrite(WX);

