Yoda49/RA8876-Driver-for-STM32F429ZIT6-FMC/RA8876_driver.c
	LCD_CmdWrite(0x71);
	LCD_DataWrite(WX>>8);

	LCD_CmdWrite(0x72);
	LCD_DataWrite(HY);

	LCD_CmdWrite(0x73);
	LCD_DataWrite(HY>>8);
}

void Square_Start_XY(unsigned short WX,unsigned short HY)
{
	/*
	[68h] Draw Line/Square/Triangle Start X-coordination [7:0]
	[69h] Draw Line/Square/Triangle Start X-coordination [12:8]
	[6Ah] Draw Line/Square/Triangle Start Y-coordination [7:0]
	[6Bh] Draw Line/Square/Triangle Start Y-coordination [12:8]
	*/
	LCD_CmdWrite(0x68);
	LCD_DataWrite(WX);

	LCD_CmdWrite(0x69);
	LCD_DataWrite(WX>>8);

	LCD_CmdWrite(0x6A);
	LCD_DataWrite(HY);

	LCD_CmdWrite(0x6B);
	LCD_DataWrite(HY>>8);
}

void Square_End_XY(unsigned short WX,unsigned short HY)
{
	/*
	[6Ch] Draw Line/Square/Triangle End X-coordination [7:0]
	[6Dh] Draw Line/Square/Triangle End X-coordination [12:8]
	[6Eh] Draw Line/Square/Triangle End Y-coordination [7:0]
	[6Fh] Draw Line/Square/Triangle End Y-coordination [12:8]
	*/
	LCD_CmdWrite(0x6C);
	LCD_DataWrite(WX);

	LCD_CmdWrite(0x6D);
	LCD_DataWrite(WX>>8);

	LCD_CmdWrite(0x6E);
	LCD_DataWrite(HY);

	LCD_CmdWrite(0x6F);
	LCD_DataWrite(HY>>8);
}
//[76h]=========================================================================
/*
[bit7]
Draw Circle / Ellipse / Square /Circle Square Start Signal 
Write Function
0 : Stop the drawing function.
1 : Start the drawing function.
Read Function
0 : Drawing function complete.
1 : Drawing function is processing.
[bit6]
Fill the Circle / Ellipse / Square / Circle Square Signal
0 : Non fill.
1 : fill.
[bit5 bit4]
Draw Circle / Ellipse / Square / Ellipse Curve / Circle Square Select
00 : Draw Circle / Ellipse
01 : Draw Circle / Ellipse Curve
10 : Draw Square.
11 : Draw Circle Square.
[bit1 bit0]
Draw Circle / Ellipse Curve Part Select
00 : 
01 : 
10 : 
11 : 
*/
void Start_Circle_or_Ellipse(void)
{
	LCD_CmdWrite(0x76);
	LCD_DataWrite(0x80);//B1000_XXXX
	Check_Busy_Draw();	
}
void Start_Circle_or_Ellipse_Fill(void)
{
	LCD_CmdWrite(0x76);
	LCD_DataWrite(0xC0);//B1100_XXXX
	Check_Busy_Draw();	
}
//
void Start_Left_Down_Curve(void)
{
	LCD_CmdWrite(0x76);
	LCD_DataWrite(0x90);//B1001_XX00
	Check_Busy_Draw();	
}
void Start_Left_Up_Curve(void)
{
	LCD_CmdWrite(0x76);
	LCD_DataWrite(0x91);//B1001_XX01
	Check_Busy_Draw();	
}
void Start_Right_Up_Curve(void)
{
	LCD_CmdWrite(0x76);
	LCD_DataWrite(0x92);//B1001_XX10
	Check_Busy_Draw();	
}
void Start_Right_Down_Curve(void)
{
	LCD_CmdWrite(0x76);
	LCD_DataWrite(0x93);//B1001_XX11
	Check_Busy_Draw();	
}
//
void Start_Left_Down_Curve_Fill(void)
{
	LCD_CmdWrite(0x76);
	LCD_DataWrite(0xD0);//B1101_XX00
	Check_Busy_Draw();
}
void Start_Left_Up_Curve_Fill(void)
{
	LCD_CmdWrite(0x76);
	LCD_DataWrite(0xD1);//B1101_XX01
	Check_Busy_Draw();
}
void Start_Right_Up_Curve_Fill(void)
{
	LCD_CmdWrite(0x76);
	LCD_DataWrite(0xD2);//B1101_XX10
	Check_Busy_Draw();
}
void Start_Right_Down_Curve_Fill(void)
{
	LCD_CmdWrite(0x76);
	LCD_DataWrite(0xD3);//B1101_XX11
	Check_Busy_Draw();
}

void Start_Square(void)
{
	LCD_CmdWrite(0x76);
	LCD_DataWrite(0xA0);//B1010_XXXX
	Check_Busy_Draw();
}
void Start_Square_Fill(void)
{
	LCD_CmdWrite(0x76);
	LCD_DataWrite(0xE0);//B1110_XXXX
	Check_Busy_Draw();
}
void Start_Circle_Square(void)
{
	LCD_CmdWrite(0x76);
	LCD_DataWrite(0xB0);//B1011_XXXX
	Check_Busy_Draw();	
}
void Start_Circle_Square_Fill(void)
{
	LCD_CmdWrite(0x76);
	LCD_DataWrite(0xF0);//B1111_XXXX
	Check_Busy_Draw();	
}

//[77h]~[7Eh]=========================================================================
void Circle_Center_XY(unsigned short WX,unsigned short HY)
{
	/*
	[7Bh] Draw Circle/Ellipse/Circle Square Center X-coordination [7:0]
	[7Ch] Draw Circle/Ellipse/Circle Square Center X-coordination [12:8]
	[7Dh] Draw Circle/Ellipse/Circle Square Center Y-coordination [7:0]
	[7Eh] Draw Circle/Ellipse/Circle Square Center Y-coordination [12:8]
	*/
	LCD_CmdWrite(0x7B);
	LCD_DataWrite(WX);

	LCD_CmdWrite(0x7C);
	LCD_DataWrite(WX>>8);

	LCD_CmdWrite(0x7D);
	LCD_DataWrite(HY);

	LCD_CmdWrite(0x7E);
	LCD_DataWrite(HY>>8);
}

void Ellipse_Center_XY(unsigned short WX,unsigned short HY)
{
	/*
	[7Bh] Draw Circle/Ellipse/Circle Square Center X-coordination [7:0]
	[7Ch] Draw Circle/Ellipse/Circle Square Center X-coordination [12:8]
	[7Dh] Draw Circle/Ellipse/Circle Square Center Y-coordination [7:0]
	[7Eh] Draw Circle/Ellipse/Circle Square Center Y-coordination [12:8]
	*/
	LCD_CmdWrite(0x7B);
	LCD_DataWrite(WX);

	LCD_CmdWrite(0x7C);
	LCD_DataWrite(WX>>8);

	LCD_CmdWrite(0x7D);
	LCD_DataWrite(HY);

	LCD_CmdWrite(0x7E);
	LCD_DataWrite(HY>>8);
}

void Circle_Radius_R(unsigned short WX)
{
	/*
	[77h] Draw Circle/Ellipse/Circle Square Major radius [7:0]
	[78h] Draw Circle/Ellipse/Circle Square Major radius [12:8]
	[79h] Draw Circle/Ellipse/Circle Square Minor radius [7:0]
	[7Ah] Draw Circle/Ellipse/Circle Square Minor radius [12:8]
	*/
	LCD_CmdWrite(0x77);
	LCD_DataWrite(WX);

	LCD_CmdWrite(0x78);
	LCD_DataWrite(WX>>8);

	LCD_CmdWrite(0x79);
	LCD_DataWrite(WX);

	LCD_CmdWrite(0x7A);
	LCD_DataWrite(WX>>8);
}

void Ellipse_Radius_RxRy(unsigned short WX,unsigned short HY)
{
/*
[77h] Draw Circle/Ellipse/Circle Square Major radius [7:0]
[78h] Draw Circle/Ellipse/Circle Square Major radius [12:8]
[79h] Draw Circle/Ellipse/Circle Square Minor radius [7:0]
[7Ah] Draw Circle/Ellipse/Circle Square Minor radius [12:8]
*/
	LCD_CmdWrite(0x77);
	LCD_DataWrite(WX);

	LCD_CmdWrite(0x78);
	LCD_DataWrite(WX>>8);

	LCD_CmdWrite(0x79);
	LCD_DataWrite(HY);

	LCD_CmdWrite(0x7A);
	LCD_DataWrite(HY>>8);
}

void Circle_Square_Radius_RxRy(unsigned short WX,unsigned short HY)
{
	/*
	[77h] Draw Circle/Ellipse/Circle Square Major radius [7:0]
	[78h] Draw Circle/Ellipse/Circle Square Major radius [12:8]
	[79h] Draw Circle/Ellipse/Circle Square Minor radius [7:0]
	[7Ah] Draw Circle/Ellipse/Circle Square Minor radius [12:8]
	*/
	LCD_CmdWrite(0x77);
	LCD_DataWrite(WX);

	LCD_CmdWrite(0x78);
	LCD_DataWrite(WX>>8);

