Yoda49/RA8876-Driver-for-STM32F429ZIT6-FMC/RA8876_driver.c
	LCD_CmdWrite(0x79);
	LCD_DataWrite(HY);

	LCD_CmdWrite(0x7A);
	LCD_DataWrite(HY>>8);
}





//[90h]~[B5h]=========================================================================

//[90h]=========================================================================
void BTE_Enable(void)
{	
	/*
	BTE Function Enable
	0 : BTE Function disable.
	1 : BTE Function enable.
	*/
    unsigned char temp;
    LCD_CmdWrite(0x90);
    temp = LCD_DataRead();
    temp |= cSetb4 ;
	LCD_DataWrite(temp);  
}

//[90h]=========================================================================
void BTE_Disable(void)
{	
	/*
	BTE Function Enable
	0 : BTE Function disable.
	1 : BTE Function enable.
	*/
    unsigned char temp;
    LCD_CmdWrite(0x90);
    temp = LCD_DataRead();
    temp &= cClrb4 ;
	LCD_DataWrite(temp);  
}

//[90h]=========================================================================
void Check_BTE_Busy(void)
{	
	/*
	BTE Function Status
	0 : BTE Function is idle.
	1 : BTE Function is busy.
	*/
	unsigned char temp; 	
	do
	{
		temp=LCD_StatusRead();
	}while(temp&0x08);

}
//[90h]=========================================================================
void Pattern_Format_8X8(void)
{	
	/*
	Pattern Format
	0 : 8X8
	1 : 16X16
	*/
    unsigned char temp;
    LCD_CmdWrite(0x90);
    temp = LCD_DataRead();
    temp &= cClrb0 ;
	LCD_DataWrite(temp);
}	
//[90h]=========================================================================
void Pattern_Format_16X16(void)
{	
	/*
	Pattern Format
	0 : 8X8
	1 : 16X16
	*/
    unsigned char temp;
    LCD_CmdWrite(0x90);
    temp = LCD_DataRead();
    temp |= cSetb0 ;
	LCD_DataWrite(temp);
}	

//[91h]=========================================================================
void BTE_ROP_Code(unsigned char setx)
{	
	/*
	BTE ROP Code[Bit7:4]
		
	0000 : 0(Blackness)
	0001 : ~S0.~S1 or ~ ( S0+S1 )
	0010 : ~S0.S1
	0011 : ~S0
	0100 : S0.~S1
	0101 : ~S1
	0110 : S0^S1
	0111 : ~S0+~S1 or ~ ( S0.S1 )
	1000 : S0.S1
	1001 : ~ ( S0^S1 )
	1010 : S1
	1011 : ~S0+S1
	1100 : S0
	1101 : S0+~S1
	1110 : S0+S1
	1111 : 1 ( Whiteness )
	*/
    unsigned char temp;
    LCD_CmdWrite(0x91);
    temp = LCD_DataRead();
    temp &= 0x0f;
	temp |= (setx<<4);
	LCD_DataWrite(temp);
}
	
//[91h]=========================================================================
void BTE_Operation_Code(unsigned char setx)
{	
	/*
	BTE Operation Code[Bit3:0]
		
	0000 : MPU Write BTE with ROP.
	0001 : MPU Read BTE w/o ROP.
	0010 : Memory copy (move) BTE in positive direction with ROP.
	0011 : Memory copy (move) BTE in negative direction with ROP.
	0100 : MPU Transparent Write BTE. (w/o ROP.)
	0101 : Transparent Memory copy (move) BTE in positive direction (w/o ROP.)
	0110 : Pattern Fill with ROP.
	0111 : Pattern Fill with key-chroma
	1000 : Color Expansion
	1001 : Color Expansion with transparency
	1010 : Move BTE in positive direction with Alpha blending
	1011 : MPU Write BTE with Alpha blending
	1100 : Solid Fill
	1101 : Reserved
	1110 : Reserved
	1111 : Reserved
	*/
    unsigned char temp;
    LCD_CmdWrite(0x91);
    temp = LCD_DataRead();
    temp &= 0xf0 ;
	temp |= setx ;
	LCD_DataWrite(temp);

}
//[92h]=========================================================================
void BTE_S0_Color_8bpp(void)
{	
	/*
	S0 Color Depth
	00 : 256 Color
	01 : 64k Color
	1x : 16M Color
	*/	
    unsigned char temp;
    LCD_CmdWrite(0x92);
    temp = LCD_DataRead();
    temp &= cClrb6 ;
	temp &= cClrb5 ;
	LCD_DataWrite(temp);
}	
//[92h]=========================================================================
void BTE_S0_Color_16bpp(void)
{	
	/*
	S0 Color Depth
	00 : 256 Color
	01 : 64k Color
	1x : 16M Color
	*/	
    unsigned char temp;
    LCD_CmdWrite(0x92);
    temp = LCD_DataRead();
    temp &= cClrb6 ;
	temp |= cSetb5 ;
	LCD_DataWrite(temp);

}	
//[92h]=========================================================================
void BTE_S0_Color_24bpp(void)
{	
	/*
	S0 Color Depth
	00 : 256 Color
	01 : 64k Color
	1x : 16M Color
	*/	
    unsigned char temp;
    LCD_CmdWrite(0x92);
    temp = LCD_DataRead();
    temp |= cSetb6 ;
	//temp |= cSetb5 ;
	LCD_DataWrite(temp);
}
//[92h]=========================================================================
void BTE_S1_Color_8bpp(void)
{	
	/*
	S1 Color Depth
	000 : 256 Color
	001 : 64k Color
	010 : 16M Color
	011 : Constant Color
	100 : 8 bit pixel alpha blending
	101 : 16 bit pixel alpha blending
	*/	
    unsigned char temp;
    LCD_CmdWrite(0x92);
    temp = LCD_DataRead();
    temp &= cClrb4 ;
	temp &= cClrb3 ;
	temp &= cClrb2 ;
	LCD_DataWrite(temp);
}	
//[92h]=========================================================================
void BTE_S1_Color_16bpp(void)
{	
	/*
	S1 Color Depth
	000 : 256 Color
	001 : 64k Color
	010 : 16M Color
	011 : Constant Color
	100 : 8 bit pixel alpha blending
	101 : 16 bit pixel alpha blending
	*/	
    unsigned char temp;
    LCD_CmdWrite(0x92);
    temp = LCD_DataRead();
    temp &= cClrb4 ;
	temp &= cClrb3 ;
	temp |= cSetb2 ;
	LCD_DataWrite(temp);

}
//[92h]=========================================================================
void BTE_S1_Color_24bpp(void)
{	
	/*
	S1 Color Depth
	000 : 256 Color
	001 : 64k Color
	010 : 16M Color
	011 : Constant Color
	100 : 8 bit pixel alpha blending
	101 : 16 bit pixel alpha blending
	*/	
    unsigned char temp;
    LCD_CmdWrite(0x92);
    temp = LCD_DataRead();
    temp &= cClrb4 ;
	temp |= cSetb3 ;
	temp &= cClrb2 ;
	LCD_DataWrite(temp);
}

//[92h]=========================================================================
void BTE_S1_Color_Constant(void)
{	
	/*
	S1 Color Depth
	000 : 256 Color
	001 : 64k Color
	010 : 16M Color
	011 : Constant Color
	100 : 8 bit pixel alpha blending
	101 : 16 bit pixel alpha blending
	*/	
    unsigned char temp;
    LCD_CmdWrite(0x92);
    temp = LCD_DataRead();
    temp &= cClrb4 ;
	temp |= cSetb3 ;
	temp |= cSetb2 ;
	LCD_DataWrite(temp);
}



