Yoda49/RA8876-Driver-for-STM32F429ZIT6-FMC/RA8876_driver.c
//[92h]=========================================================================
void BTE_S1_Color_8bit_Alpha(void)
{	
	/*
	S1 Color Depth
	000 : 256 Color
	001 : 64k Color
	010 : 16M Color
	011 : Constant Color
	100 : 8 bit pixel alpha blending
	101 : 16 bit pixel alpha blending
	*/	
    unsigned char temp;
    LCD_CmdWrite(0x92);
    temp = LCD_DataRead();
    temp |= cSetb4 ;
	temp &= cClrb3 ;
	temp &= cClrb2 ;
	LCD_DataWrite(temp);
}

//[92h]=========================================================================
void BTE_S1_Color_16bit_Alpha(void)
{	
	/*
	S1 Color Depth
	000 : 256 Color
	001 : 64k Color
	010 : 16M Color
	011 : Constant Color
	100 : 8 bit pixel alpha blending
	101 : 16 bit pixel alpha blending
	*/	
    unsigned char temp;
    LCD_CmdWrite(0x92);
    temp = LCD_DataRead();
    temp |= cSetb4 ;
	temp &= cClrb3 ;
	temp |= cSetb2 ;
	LCD_DataWrite(temp);
}

//[92h]=========================================================================
void BTE_Destination_Color_8bpp(void)
{	
	/*
	Destination Color Depth
	00 : 256 Color
	01 : 64k Color
	1x : 16M Color
	*/	
    unsigned char temp;
    LCD_CmdWrite(0x92);
    temp = LCD_DataRead();
    temp &= cClrb1 ;
	temp &= cClrb0 ;
	LCD_DataWrite(temp);
}	
//[92h]=========================================================================
void BTE_Destination_Color_16bpp(void)
{	
	/*
	Destination Color Depth
	00 : 256 Color
	01 : 64k Color
	1x : 16M Color
	*/	
    unsigned char temp;
    LCD_CmdWrite(0x92);
    temp = LCD_DataRead();
    temp &= cClrb1 ;
	temp |= cSetb0 ;
	LCD_DataWrite(temp);

}	
//[92h]=========================================================================
void BTE_Destination_Color_24bpp(void)
{	
	/*
	Destination Color Depth
	00 : 256 Color
	10 : 64k Color
	1x : 16M Color
	*/	
    unsigned char temp;
    LCD_CmdWrite(0x92);
    temp = LCD_DataRead();
    temp |= cSetb1 ;
	//temp |= cSetb0 ;
	LCD_DataWrite(temp);
}


//[93h][94h][95h][96h]=========================================================================
void BTE_S0_Memory_Start_Address(unsigned long Addr)	
{
	/*
	[93h] BTE S0 Memory Start Address [7:0]
	[94h] BTE S0 Memory Start Address [15:8]
	[95h] BTE S0 Memory Start Address [23:16]
	[96h] BTE S0 Memory Start Address [31:24]
	Bit [1:0] tie to “0” internally.
	*/
	LCD_RegisterWrite(0x93,Addr);
	LCD_RegisterWrite(0x94,Addr>>8);
	LCD_RegisterWrite(0x95,Addr>>16);
	LCD_RegisterWrite(0x96,Addr>>24);
}


//[97h][98h]=========================================================================
void BTE_S0_Image_Width(unsigned short WX)	
{
	/*
	[97h] BTE S0 Image Width [7:0]
	[98h] BTE S0 Image Width [12:8]
	Unit: Pixel.
	Bit [1:0] tie to “0” internally.
	*/
	LCD_RegisterWrite(0x97,WX);
	LCD_RegisterWrite(0x98,WX>>8);
}


//[99h][9Ah][9Bh][9Ch]=========================================================================
void BTE_S0_Window_Start_XY(unsigned short WX,unsigned short HY)	
{
	/*
	[99h] BTE S0 Window Upper-Left corner X-coordination [7:0]
	[9Ah] BTE S0 Window Upper-Left corner X-coordination [12:8]
	[9Bh] BTE S0 Window Upper-Left corner Y-coordination [7:0]
	[9Ch] BTE S0 Window Upper-Left corner Y-coordination [12:8]
	*/
	LCD_RegisterWrite(0x99,WX);
	LCD_RegisterWrite(0x9A,WX>>8);

	LCD_RegisterWrite(0x9B,HY);
	LCD_RegisterWrite(0x9C,HY>>8);
}




//[9Dh][9Eh][9Fh][A0h]=========================================================================
void BTE_S1_Memory_Start_Address(unsigned long Addr)	
{
	/*
	[9Dh] BTE S1 Memory Start Address [7:0]
	[9Eh] BTE S1 Memory Start Address [15:8]
	[9Fh] BTE S1 Memory Start Address [23:16]
	[A0h] BTE S1 Memory Start Address [31:24]
	Bit [1:0] tie to “0” internally.
	*/
	LCD_RegisterWrite(0x9D,Addr);
	LCD_RegisterWrite(0x9E,Addr>>8);
	LCD_RegisterWrite(0x9F,Addr>>16);
	LCD_RegisterWrite(0xA0,Addr>>24);
}


//Input data format:R3G3B2
void S1_Constant_color_256(unsigned char temp)
{
    LCD_CmdWrite(0x9D);
    LCD_DataWrite(temp);

    LCD_CmdWrite(0x9E);
    LCD_DataWrite(temp<<3);

    LCD_CmdWrite(0x9F);
    LCD_DataWrite(temp<<6);
}

//Input data format:R5G6B6
void S1_Constant_color_65k(unsigned short temp)
{
    LCD_CmdWrite(0x9D);
    LCD_DataWrite(temp>>8);

    LCD_CmdWrite(0x9E);
    LCD_DataWrite(temp>>3);

    LCD_CmdWrite(0x9F);
    LCD_DataWrite(temp<<3);
}

//Input data format:R8G8B8
void S1_Constant_color_16M(unsigned long temp)
{
    LCD_CmdWrite(0x9D);
    LCD_DataWrite(temp>>16);

    LCD_CmdWrite(0x9E);
    LCD_DataWrite(temp>>8);

    LCD_CmdWrite(0x9F);
    LCD_DataWrite(temp);
}




//[A1h][A2h]=========================================================================
void BTE_S1_Image_Width(unsigned short WX)	
{
	/*
	[A1h] BTE S1 Image Width [7:0]
	[A2h] BTE S1 Image Width [12:8]
	Unit: Pixel.
	Bit [1:0] tie to “0” internally.
	*/
	LCD_RegisterWrite(0xA1,WX);
	LCD_RegisterWrite(0xA2,WX>>8);
}


//[A3h][A4h][A5h][A6h]=========================================================================
void BTE_S1_Window_Start_XY(unsigned short WX,unsigned short HY)	
{
	/*
	[A3h] BTE S1 Window Upper-Left corner X-coordination [7:0]
	[A4h] BTE S1 Window Upper-Left corner X-coordination [12:8]
	[A5h] BTE S1 Window Upper-Left corner Y-coordination [7:0]
	[A6h] BTE S1 Window Upper-Left corner Y-coordination [12:8]
	*/
	LCD_RegisterWrite(0xA3,WX);
	LCD_RegisterWrite(0xA4,WX>>8);

	LCD_RegisterWrite(0xA5,HY);
	LCD_RegisterWrite(0xA6,HY>>8);
}




//[A7h][A8h][A9h][AAh]=========================================================================
void BTE_Destination_Memory_Start_Address(unsigned long Addr)	
{
	/*
	[A7h] BTE Destination Memory Start Address [7:0]
	[A8h] BTE Destination Memory Start Address [15:8]
	[A9h] BTE Destination Memory Start Address [23:16]
	[AAh] BTE Destination Memory Start Address [31:24]
	Bit [1:0] tie to “0” internally.
	*/
	LCD_RegisterWrite(0xA7,Addr);
	LCD_RegisterWrite(0xA8,Addr>>8);
	LCD_RegisterWrite(0xA9,Addr>>16);
	LCD_RegisterWrite(0xAA,Addr>>24);
}


