Yoda49/RA8876-Driver-for-STM32F429ZIT6-FMC/RA8876_driver.c
//[ABh][ACh]=========================================================================
void BTE_Destination_Image_Width(unsigned short WX)	
{
	/*
	[ABh] BTE Destination Image Width [7:0]
	[ACh] BTE Destination Image Width [12:8]
	Unit: Pixel.
	Bit [1:0] tie to “0” internally.
	*/
	LCD_RegisterWrite(0xAB,WX);
	LCD_RegisterWrite(0xAC,WX>>8);
}


//[ADh][AEh][AFh][B0h]=========================================================================
void BTE_Destination_Window_Start_XY(unsigned short WX,unsigned short HY)	
{
	/*
	[ADh] BTE Destination Window Upper-Left corner X-coordination [7:0]
	[AEh] BTE Destination Window Upper-Left corner X-coordination [12:8]
	[AFh] BTE Destination Window Upper-Left corner Y-coordination [7:0]
	[B0h] BTE Destination Window Upper-Left corner Y-coordination [12:8]
	*/
	LCD_RegisterWrite(0xAD,WX);
	LCD_RegisterWrite(0xAE,WX>>8);

	LCD_RegisterWrite(0xAF,HY);
	LCD_RegisterWrite(0xB0,HY>>8);
}


//[B1h][B2h][B3h][B4h]===============================================================

void BTE_Window_Size(unsigned short WX, unsigned short WY)

{
	/*
	[B1h] BTE Window Width [7:0]
	[B2h] BTE Window Width [12:8]

	[B3h] BTE Window Height [7:0]
	[B4h] BTE Window Height [12:8]
	*/
	LCD_RegisterWrite(0xB1,WX);
	LCD_RegisterWrite(0xB2,WX>>8);

	LCD_RegisterWrite(0xB3,WY);
	LCD_RegisterWrite(0xB4,WY>>8);
}

//[B5h]=========================================================================
void BTE_Alpha_Blending_Effect(unsigned char temp)
{	
	/*
	Window Alpha Blending effect for S0 & S1
	The value of alpha in the color code ranges from 0.0 to 1.0,
	where 0.0 represents a fully transparent color, and 1.0
	represents a fully opaque color.
	00h: 0
	01h: 1/32
	02h: 2/32
	:
	1Eh: 30/32
	1Fh: 31/32
	2Xh: 1
	Output Effect = (S0 image x (1 - alpha setting value)) + (S1 image x alpha setting value)
	*/
    LCD_CmdWrite(0xB5);
	LCD_DataWrite(temp);  
}








//[B6h]=========================================================================
void Start_SFI_DMA(void)
{
	unsigned char temp;
	LCD_CmdWrite(0xB6);
	temp = LCD_DataRead();
    temp |= cSetb0;
	LCD_DataWrite(temp);
}

void Check_Busy_SFI_DMA(void)
{
	LCD_CmdWrite(0xB6);
	while (LCD_DataRead()&0x01) {};
}


//[B7h]=========================================================================
void Select_SFI_0(void)
{
	/*[bit7]
	Serial Flash/ROM I/F # Select
	0: Serial Flash/ROM 0 I/F is selected.
	1: Serial Flash/ROM 1 I/F is selected.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xB7);
	temp = LCD_DataRead();
    temp &= cClrb7;
	LCD_DataWrite(temp);
}
void Select_SFI_1(void)
{
	/*[bit7]
	Serial Flash/ROM I/F # Select
	0: Serial Flash/ROM 0 I/F is selected.
	1: Serial Flash/ROM 1 I/F is selected.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xB7);
	temp = LCD_DataRead();
    temp |= cSetb7;
	LCD_DataWrite(temp);
}
void Select_SFI_Font_Mode(void)
{
	/*[bit6]
	Serial Flash /ROM Access Mode
	0: Font mode – for external cgrom
	1: DMA mode – for cgram , pattern , bootstart image or osd
	*/
	unsigned char temp;
	LCD_CmdWrite(0xB7);
	temp = LCD_DataRead();
    temp &= cClrb6;
	LCD_DataWrite(temp);
}
void Select_SFI_DMA_Mode(void)
{
	/*[bit6]
	Serial Flash /ROM Access Mode
	0: Font mode – for external cgrom
	1: DMA mode – for cgram , pattern , bootstart image or osd
	*/
	unsigned char temp;
	LCD_CmdWrite(0xB7);
	temp = LCD_DataRead();
    temp |= cSetb6;
	LCD_DataWrite(temp);
}
void Select_SFI_24bit_Address(void)
{
	/*[bit5]
	Serial Flash/ROM Address Mode
	0: 24 bits address mode
	1: 32 bits address mode
	*/
	unsigned char temp;
	LCD_CmdWrite(0xB7);
	temp = LCD_DataRead();
    temp &= cClrb5;
	LCD_DataWrite(temp);
}
void Select_SFI_32bit_Address(void)
{
	/*[bit5]
	Serial Flash/ROM Address Mode
	0: 24 bits address mode
	1: 32 bits address mode
	*/
	unsigned char temp;
	LCD_CmdWrite(0xB7);
	temp = LCD_DataRead();
    temp |= cSetb5;
	LCD_DataWrite(temp);
}
void Select_SFI_Waveform_Mode_0(void)
{
	/*[bit4]
	Serial Flash/ROM Waveform Mode
	Mode 0.
	Mode 3.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xB7);
	temp = LCD_DataRead();
    temp &= cClrb4;
	LCD_DataWrite(temp);
}
void Select_SFI_Waveform_Mode_3(void)
{
	/*[bit4]
	Serial Flash/ROM Waveform Mode
	Mode 0.
	Mode 3.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xB7);
	temp = LCD_DataRead();
    temp |= cSetb4;
	LCD_DataWrite(temp);
}
void Select_SFI_0_DummyRead(void)
{
	/*[bit3][bit2]
	Serial Flash /ROM Read Cycle 0 RW
	00b: no dummy cycle mode
	01b: 1 dummy cycle mode
	10b: 2 dummy cycle mode
	11b: 4 dummy cycle mode
	*/
	unsigned char temp;
	LCD_CmdWrite(0xB7);
	temp = LCD_DataRead();
	temp &= 0xF3;
	LCD_DataWrite(temp);
}
void Select_SFI_8_DummyRead(void)
{
	unsigned char temp;
	LCD_CmdWrite(0xB7);
	temp = LCD_DataRead();
	temp &= 0xF3;
    temp |= cSetb2;
	LCD_DataWrite(temp);
}
void Select_SFI_16_DummyRead(void)
{

	unsigned char temp;
	LCD_CmdWrite(0xB7);
	temp = LCD_DataRead();
	temp &= 0xF3;
    temp |= cSetb3;
	LCD_DataWrite(temp);
}
void Select_SFI_24_DummyRead(void)
{
	unsigned char temp;
	LCD_CmdWrite(0xB7);
	temp = LCD_DataRead();
    temp |= 0x0c;
	LCD_DataWrite(temp);
}
void Select_SFI_Single_Mode(void)
{
	/*[bit1][bit0]
	Serial Flash /ROM I/F Data Latch Mode Select
	0Xb: Single Mode
	10b: Dual Mode 0.
	11b: Dual Mode 1.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xB7);
	temp = LCD_DataRead();
	temp &= 0xFC;
	LCD_DataWrite(temp);
}

void Select_SFI_Dual_Mode0(void)
{
	unsigned char temp;
	LCD_CmdWrite(0xB7);
	temp = LCD_DataRead();
	temp &= 0xFC;
    temp |= cSetb1;
	LCD_DataWrite(temp);
}

void Select_SFI_Dual_Mode1(void)
{
	unsigned char temp;
	LCD_CmdWrite(0xB7);
	temp = LCD_DataRead();
    temp |= 0x03;
	LCD_DataWrite(temp);
}

//REG[B8h] SPI master Tx /Rx FIFO Data Register (SPIDR) 
unsigned char SPI_Master_FIFO_Data_Put(unsigned char Data)
{
    unsigned char temp;
	LCD_CmdWrite(0xB8);
	LCD_DataWrite(Data);
	while(Tx_FIFO_Empty_Flag()==0);
	temp = SPI_Master_FIFO_Data_Get();
	return temp;
}

unsigned char SPI_Master_FIFO_Data_Get(void)
{
	unsigned char temp;

	while (Rx_FIFO_Empty_Flag() == 1);
	LCD_CmdWrite(0xB8);
	temp=LCD_DataRead();
	//while(Rx_FIFO_full_flag());
	return temp;
}

//REG[B9h] SPI master Control Register (SPIMCR2) 
void Mask_SPI_Master_Interrupt_Flag(void)
{
	unsigned char temp;
	LCD_CmdWrite(0xB9);
	temp = LCD_DataRead();
	temp |= cSetb6;
	LCD_DataWrite(temp);
} 

void Select_nSS_drive_on_xnsfcs0(void)
{
	unsigned char temp;
	LCD_CmdWrite(0xB9);
	temp = LCD_DataRead();
	temp &= cClrb5;
	LCD_DataWrite(temp);
}

void Select_nSS_drive_on_xnsfcs1(void)
{
	unsigned char temp;
	LCD_CmdWrite(0xB9);
	temp = LCD_DataRead();
	temp |= cSetb5;
	LCD_DataWrite(temp);
}

