Yoda49/RA8876-Driver-for-STM32F429ZIT6-FMC/RA8876_driver.c
//0: inactive (nSS port will goes high) 
void nSS_Inactive(void)
{
	unsigned char temp;
	LCD_CmdWrite(0xB9);
	temp = LCD_DataRead();
	temp &= cClrb4;
	LCD_DataWrite(temp);
}
//1: active (nSS port will goes low) 
void nSS_Active(void)
{
	unsigned char temp;
	LCD_CmdWrite(0xB9);
	temp = LCD_DataRead();
	temp |= cSetb4;
	LCD_DataWrite(temp);
}

//Interrupt enable for FIFO overflow error [OVFIRQEN] 
void OVFIRQEN_Enable(void)
{
	unsigned char temp;
	LCD_CmdWrite(0xB9);
	temp = LCD_DataRead();
	temp |= cSetb3;
	LCD_DataWrite(temp);
}
//Interrupt enable for while Tx FIFO empty & SPI engine/FSM idle
void EMTIRQEN_Enable(void)
{
	unsigned char temp;
	LCD_CmdWrite(0xB9);
	temp = LCD_DataRead();
	temp |= cSetb2;
	LCD_DataWrite(temp);
}


//At CPOL=0 the base value of the clock is zero   
//o  For CPHA=0, data are read on the clock's rising edge (low->high transition) and 
//data are changed on a falling edge (high->low clock transition). 
//o  For CPHA=1, data are read on the clock's falling edge and data are changed on a 
//rising edge. 

//At CPOL=1 the base value of the clock is one (inversion of CPOL=0)   
//o  For CPHA=0, data are read on clock's falling edge and data are changed on a 
//rising edge. 
//o  For CPHA=1, data are read on clock's rising edge and data are changed on a 
//falling edge.

void Reset_CPOL(void)
{
	unsigned char temp;
	LCD_CmdWrite(0xB9);
	temp = LCD_DataRead();
	temp &= cClrb1;
	LCD_DataWrite(temp);
}

void Set_CPOL(void)
{
	unsigned char temp;
	LCD_CmdWrite(0xB9);
	temp = LCD_DataRead();
	temp |= cSetb1;
	LCD_DataWrite(temp);
}


void Reset_CPHA(void)
{
	unsigned char temp;
	LCD_CmdWrite(0xB9);
	temp = LCD_DataRead();
	temp &= cClrb0;
	LCD_DataWrite(temp);
}

void Set_CPHA(void)
{
	unsigned char temp;
	LCD_CmdWrite(0xB9);
	temp = LCD_DataRead();
	temp |= cSetb0;
	LCD_DataWrite(temp);
}


//REG[BAh] SPI master Status Register (SPIMSR) 
unsigned char Tx_FIFO_Empty_Flag(void)
{
	LCD_CmdWrite(0xBA);
	if((LCD_DataRead()&0x80)==0x80)
	return 1;
	else
	return 0;
}

unsigned char Tx_FIFO_Full_Flag(void)
{
	LCD_CmdWrite(0xBA);
	if((LCD_DataRead()&0x40)==0x40)
	return 1;
	else
	return 0;
} 

unsigned char Rx_FIFO_Empty_Flag(void)
{
	LCD_CmdWrite(0xBA);
	if((LCD_DataRead()&0x20)==0x20)
	return 1;
	else
	return 0;
} 

unsigned char Rx_FIFO_full_flag(void)
{
	LCD_CmdWrite(0xBA);
	if((LCD_DataRead()&0x10)==0x10)
	return 1;
	else
	return 0;
} 

unsigned char OVFI_Flag(void)
{
	LCD_CmdWrite(0xBA);
	if((LCD_DataRead()&0x08)==0x08)
	return 1;
	else
	return 0;
}

void Clear_OVFI_Flag(void)
{
	unsigned char temp;
	LCD_CmdWrite(0xBA);
	temp = LCD_DataRead();
	temp |= cSetb3;
	LCD_DataWrite(temp);
}

unsigned char EMTI_Flag(void)
{
	LCD_CmdWrite(0xBA);
	if((LCD_DataRead()&0x04)==0x04)
	return 1;
	else
	return 0;
}

void Clear_EMTI_Flag(void)
{
	unsigned char temp;
	LCD_CmdWrite(0xBA);
	temp = LCD_DataRead();
	temp |= cSetb2;
	LCD_DataWrite(temp);
}


//REG[BB] SPI Clock period (SPIDIV) 
void SPI_Clock_Period(unsigned char temp)
{
	LCD_CmdWrite(0xBB);
	LCD_DataWrite(temp);
} 

//[BCh][BDh][BEh][BFh]=========================================================================
void SFI_DMA_Source_Start_Address(unsigned long Addr)
{
	/*
	DMA Source START ADDRESS
	This bits index serial flash address [7:0][15:8][23:16][31:24]
	*/
	LCD_CmdWrite(0xBC);
	LCD_DataWrite(Addr);
	LCD_CmdWrite(0xBD);
	LCD_DataWrite(Addr>>8);
	LCD_CmdWrite(0xBE);
	LCD_DataWrite(Addr>>16);
	LCD_CmdWrite(0xBF);
	LCD_DataWrite(Addr>>24);
}
//[C0h][C1h][C2h][C3h]=========================================================================
void SFI_DMA_Destination_Start_Address(unsigned long Addr)
{
	/*
	DMA Destination START ADDRESS 
	[1:0]Fix at 0
	This bits index SDRAM address [7:0][15:8][23:16][31:24]
	*/
	LCD_CmdWrite(0xC0);
	LCD_DataWrite(Addr);
	LCD_CmdWrite(0xC1);
	LCD_DataWrite(Addr>>8);
	LCD_CmdWrite(0xC2);
	LCD_DataWrite(Addr>>16);
	LCD_CmdWrite(0xC3);
	LCD_DataWrite(Addr>>24);
}
//[C0h][C1h][C2h][C3h]=========================================================================
void SFI_DMA_Destination_Upper_Left_Corner(unsigned short WX,unsigned short HY)
{
	/*
	C0h
	This register defines DMA Destination Window Upper-Left corner 
	X-coordination [7:0] on Canvas area. 
	When REG DMACR bit 1 = 1 (Block Mode) 
	This register defines Destination address [7:2] in SDRAM. 
	C1h
	When REG DMACR bit 1 = 0 (Linear Mode) 
	This register defines DMA Destination Window Upper-Left corner 
	X-coordination [12:8] on Canvas area. 
	When REG DMACR bit 1 = 1 (Block Mode) 
	This register defines Destination address [15:8] in SDRAM.
	C2h
	When REG DMACR bit 1 = 0 (Linear Mode) 
	This register defines DMA Destination Window Upper-Left corner
	Y-coordination [7:0] on Canvas area. 
	When REG DMACR bit 1 = 1 (Block Mode) 
	This register defines Destination address [23:16] in SDRAM. 
	C3h
	When REG DMACR bit 1 = 0 (Linear Mode) 
	This register defines DMA Destination Window Upper-Left corner 
	Y-coordination [12:8] on Canvas area. 
	When REG DMACR bit 1 = 1 (Block Mode) 
	This register defines Destination address [31:24] in SDRAM. 
	*/
 
	LCD_CmdWrite(0xC0);
	LCD_DataWrite(WX);
	LCD_CmdWrite(0xC1);
	LCD_DataWrite(WX>>8);
	
	LCD_CmdWrite(0xC2);
	LCD_DataWrite(HY);
	LCD_CmdWrite(0xC3);
	LCD_DataWrite(HY>>8);
}



//[C6h][C7h][C8h][C9h]=========================================================================
void SFI_DMA_Transfer_Number(unsigned long Addr)
{
	/*
	Unit : Pixel
	When REG DMACR bit 1 = 0 (Linear Mode)
	DMA Transfer Number [7:0][15:8][23:16][31:24]

	When REG DMACR bit 1 = 1 (Block Mode)
	DMA Block Width [7:0][15:8]
	DMA Block HIGH[7:0][15:8]
	*/
	LCD_CmdWrite(0xC6);
	LCD_DataWrite(Addr);
	LCD_CmdWrite(0xC7);
	LCD_DataWrite(Addr>>8);
	LCD_CmdWrite(0xC8);
	LCD_DataWrite(Addr>>16);
	LCD_CmdWrite(0xC9);
	LCD_DataWrite(Addr>>24);
}
void SFI_DMA_Transfer_Width_Height(unsigned short WX,unsigned short HY)
{
	/*
	When REG DMACR bit 1 = 0 (Linear Mode)
	DMA Transfer Number [7:0][15:8][23:16][31:24]

	When REG DMACR bit 1 = 1 (Block Mode)
	DMA Block Width [7:0][15:8]
	DMA Block HIGH[7:0][15:8]
	*/
	LCD_CmdWrite(0xC6);
	LCD_DataWrite(WX);
	LCD_CmdWrite(0xC7);
	LCD_DataWrite(WX>>8);

