Yoda49/RA8876-Driver-for-STM32F429ZIT6-FMC/RA8876_driver.c
	LCD_CmdWrite(0xC8);
	LCD_DataWrite(HY);
	LCD_CmdWrite(0xC9);
	LCD_DataWrite(HY>>8);
}
//[CAh][CBh]=========================================================================
void SFI_DMA_Source_Width(unsigned short WX)
{
	/*
	DMA Source Picture Width [7:0][12:8]
	Unit: pixel
	*/
	LCD_CmdWrite(0xCA);
	LCD_DataWrite(WX);
	LCD_CmdWrite(0xCB);
	LCD_DataWrite(WX>>8);
}









//[CCh]=========================================================================

void Font_Select_UserDefine_Mode(void)
{
	/*[bit7-6]
	User-defined Font /CGROM Font Selection Bit in Text Mode
	00 : Internal CGROM
	01 : Genitop serial flash
	10 : User-defined Font
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCC);
	temp = LCD_DataRead();
    temp |= cSetb7;
	temp &= cClrb6;
	LCD_DataWrite(temp);
}
void CGROM_Select_Internal_CGROM(void)
{
	/*[bit7-6]
	User-defined Font /CGROM Font Selection Bit in Text Mode
	00 : Internal CGROM
	01 : Genitop serial flash
	10 : User-defined Font
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCC);
	temp = LCD_DataRead();
	temp &= cClrb7;
    temp &= cClrb6;
	LCD_DataWrite(temp);
}
void CGROM_Select_Genitop_FontROM(void)
{
	/*[bit7-6]
	User-defined Font /CGROM Font Selection Bit in Text Mode
	00 : Internal CGROM
	01 : Genitop serial flash
	10 : User-defined Font
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCC);
	temp = LCD_DataRead();
	temp &= cClrb7;
    temp |= cSetb6;
	LCD_DataWrite(temp);
}
void Font_Select_8x16_16x16(void)
{
	/*[bit5-4]
	Font Height Setting
	00b : 8x16 / 16x16.
	01b : 12x24 / 24x24.
	10b : 16x32 / 32x32.
	*** User-defined Font width is decided by font code. Genitop
	serial flash’s font width is decided by font code or GT Font ROM
	control register.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCC);
	temp = LCD_DataRead();
    temp &= cClrb5;
    temp &= cClrb4;
	LCD_DataWrite(temp);
}
void Font_Select_12x24_24x24(void)
{
	/*[bit5-4]
	Font Height Setting
	00b : 8x16 / 16x16.
	01b : 12x24 / 24x24.
	10b : 16x32 / 32x32.
	*** User-defined Font width is decided by font code. Genitop
	serial flash’s font width is decided by font code or GT Font ROM
	control register.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCC);
	temp = LCD_DataRead();
    temp &= cClrb5;
    temp |= cSetb4;
	LCD_DataWrite(temp);
}
void Font_Select_16x32_32x32(void)
{
	/*[bit5-4]
	Font Height Setting
	00b : 8x16 / 16x16.
	01b : 12x24 / 24x24.
	10b : 16x32 / 32x32.
	*** User-defined Font width is decided by font code. Genitop
	serial flash’s font width is decided by font code or GT Font ROM
	control register.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCC);
	temp = LCD_DataRead();
    temp |= cSetb5;
    temp &= cClrb4;
	LCD_DataWrite(temp);
}
void Internal_CGROM_Select_ISOIEC8859_1(void)
{
	/*
	Font Selection for internal CGROM
	When FNCR0 B7 = 0 and B5 = 0, Internal CGROM supports the
	8x16 character sets with the standard coding of ISO/IEC 8859-1~4, 
	which supports English and most of European country languages.
	00b : ISO/IEC 8859-1.
	01b : ISO/IEC 8859-2.
	10b : ISO/IEC 8859-3.
	11b : ISO/IEC 8859-4.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCC);
	temp = LCD_DataRead();
    temp &= cClrb1;
    temp &= cClrb0;
	LCD_DataWrite(temp);
}
void Internal_CGROM_Select_ISOIEC8859_2(void)
{
	/*
	Font Selection for internal CGROM
	When FNCR0 B7 = 0 and B5 = 0, Internal CGROM supports the
	8x16 character sets with the standard coding of ISO/IEC 8859-1~4, 
	which supports English and most of European country languages.
	00b : ISO/IEC 8859-1.
	01b : ISO/IEC 8859-2.
	10b : ISO/IEC 8859-3.
	11b : ISO/IEC 8859-4.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCC);
	temp = LCD_DataRead();
    temp &= cClrb1;
    temp |= cSetb0;
	LCD_DataWrite(temp);
}
void Internal_CGROM_Select_ISOIEC8859_3(void)
{
	/*
	Font Selection for internal CGROM
	When FNCR0 B7 = 0 and B5 = 0, Internal CGROM supports the
	8x16 character sets with the standard coding of ISO/IEC 8859-1~4, 
	which supports English and most of European country languages.
	00b : ISO/IEC 8859-1.
	01b : ISO/IEC 8859-2.
	10b : ISO/IEC 8859-3.
	11b : ISO/IEC 8859-4.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCC);
	temp = LCD_DataRead();
    temp |= cSetb1;
    temp &= cClrb0;
	LCD_DataWrite(temp);
}
void Internal_CGROM_Select_ISOIEC8859_4(void)
{
	/*
	Font Selection for internal CGROM
	When FNCR0 B7 = 0 and B5 = 0, Internal CGROM supports the
	8x16 character sets with the standard coding of ISO/IEC 8859-1~4, 
	which supports English and most of European country languages.
	00b : ISO/IEC 8859-1.
	01b : ISO/IEC 8859-2.
	10b : ISO/IEC 8859-3.
	11b : ISO/IEC 8859-4.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCC);
	temp = LCD_DataRead();
    temp |= cSetb1;
    temp |= cSetb0;
	LCD_DataWrite(temp);
}
//[CDh]=========================================================================
void Enable_Font_Alignment(void)
{
	/*
	Full Alignment Selection Bit
	0 : Full alignment disable.
	1 : Full alignment enable.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCD);
	temp = LCD_DataRead();
    temp |= cSetb7;
	LCD_DataWrite(temp);
}
void Disable_Font_Alignment(void)
{
	/*
	Full Alignment Selection Bit
	0 : Full alignment disable.
	1 : Full alignment enable.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCD);
	temp = LCD_DataRead();
    temp &= cClrb7;
	LCD_DataWrite(temp);
}
void Font_Background_select_Transparency(void)
{
	/*
	Font Transparency
	0 : Font with background color.
	1 : Font with background transparency.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCD);
	temp = LCD_DataRead();
    temp |= cSetb6;
	LCD_DataWrite(temp);
}
void Font_Background_select_Color(void)
{
	/*
	Font Transparency
	0 : Font with background color.
	1 : Font with background transparency.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCD);
	temp = LCD_DataRead();
    temp &= cClrb6;
	LCD_DataWrite(temp);
}
void Font_0_degree(void)
{
	/*
	Font Rotation
	0 : Normal
	Text direction from left to right then from top to bottom
	1 : Counterclockwise 90 degree & horizontal flip
	Text direction from top to bottom then from left to right
	(it should accommodate with set VDIR as 1)
	This attribute can be changed only when previous font write
	finished (core_busy = 0)
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCD);
	temp = LCD_DataRead();
    temp &= cClrb4;
	LCD_DataWrite(temp);
}
void Font_90_degree(void)
{
	/*
	Font Rotation
	0 : Normal
	Text direction from left to right then from top to bottom
	1 : Counterclockwise 90 degree & horizontal flip
	Text direction from top to bottom then from left to right
	(it should accommodate with set VDIR as 1)
	This attribute can be changed only when previous font write
	finished (core_busy = 0)
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCD);
	temp = LCD_DataRead();
    temp |= cSetb4;
	LCD_DataWrite(temp);
}
void Font_Width_X1(void)
{
	/*
	Horizontal Font Enlargement
	00b : X1.
	01b : X2.
	10b : X3.
	11b : X4.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCD);
	temp = LCD_DataRead();
    temp &= cClrb3;
    temp &= cClrb2;
	LCD_DataWrite(temp);
}
void Font_Width_X2(void)
{
	/*
	Horizontal Font Enlargement
	00b : X1.
	01b : X2.
	10b : X3.
	11b : X4.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCD);
	temp = LCD_DataRead();
    temp &= cClrb3;
    temp |= cSetb2;
	LCD_DataWrite(temp);
}
void Font_Width_X3(void)
{
	/*
	Horizontal Font Enlargement
	00b : X1.
	01b : X2.
	10b : X3.
	11b : X4.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCD);
	temp = LCD_DataRead();
    temp |= cSetb3;
    temp &= cClrb2;
	LCD_DataWrite(temp);
}
void Font_Width_X4(void)
{
	/*
	Horizontal Font Enlargement
	00b : X1.
	01b : X2.
	10b : X3.
	11b : X4.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCD);
	temp = LCD_DataRead();
    temp |= cSetb3;
    temp |= cSetb2;
	LCD_DataWrite(temp);
}
void Font_Height_X1(void)
{
	/*
	Vertical Font Enlargement
	00b : X1.
	01b : X2.
	10b : X3.
	11b : X4.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCD);
	temp = LCD_DataRead();
    temp &= cClrb1;
    temp &= cClrb0;
	LCD_DataWrite(temp);
}
void Font_Height_X2(void)
{
	/*
	Vertical Font Enlargement
	00b : X1.
	01b : X2.
	10b : X3.
	11b : X4.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCD);
	temp = LCD_DataRead();
    temp &= cClrb1;
    temp |= cSetb0;
	LCD_DataWrite(temp);
}
void Font_Height_X3(void)
{
	/*
	Vertical Font Enlargement
	00b : X1.
	01b : X2.
	10b : X3.
	11b : X4.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCD);
	temp = LCD_DataRead();
    temp |= cSetb1;
    temp &= cClrb0;
	LCD_DataWrite(temp);
}
void Font_Height_X4(void)
{
	/*
	Vertical Font Enlargement
	00b : X1.
	01b : X2.
	10b : X3.
	11b : X4.
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCD);
	temp = LCD_DataRead();
    temp |= cSetb1;
    temp |= cSetb0;
	LCD_DataWrite(temp);
}

//[CEh]=========================================================================
void GTFont_Select_GT21L16TW_GT21H16T1W (void)
{
	/*
	GT Serial Font ROM Select
	000b: GT21L16TW / GT21H16T1W
	001b: GT23L16U2W
	010b: GT23L24T3Y / GT23H24T3Y
	011b: GT23L24M1Z
	100b: GT23L32S4W / GT23H32S4W
	101b: GT20L24F6Y
	110b: GT21L24S1W
	111b: GT22L16A1Y
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCE);
	temp = LCD_DataRead();
    temp &= cClrb7;
    temp &= cClrb6;
    temp &= cClrb5;
	LCD_DataWrite(temp);
}

void GTFont_Select_GT23L16U2W(void)
{
	/*
	GT Serial Font ROM Select
	000b: GT21L16TW / GT21H16T1W
	001b: GT23L16U2W
	010b: GT23L24T3Y / GT23H24T3Y
	011b: GT23L24M1Z
	100b: GT23L32S4W / GT23H32S4W
	101b: GT20L24F6Y
	110b: GT21L24S1W
	111b: GT22L16A1Y
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCE);
	temp = LCD_DataRead();
    temp &= cClrb7;
    temp &= cClrb6;
    temp |= cSetb5;
	LCD_DataWrite(temp);
}

void GTFont_Select_GT23L24T3Y_GT23H24T3Y(void)
{
	/*
	GT Serial Font ROM Select
	000b: GT21L16TW / GT21H16T1W
	001b: GT23L16U2W
	010b: GT23L24T3Y / GT23H24T3Y
	011b: GT23L24M1Z
	100b: GT23L32S4W / GT23H32S4W
	101b: GT20L24F6Y
	110b: GT21L24S1W
	111b: GT22L16A1Y
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCE);
	temp = LCD_DataRead();
    temp &= cClrb7;
    temp |= cSetb6;
    temp &= cClrb5;
	LCD_DataWrite(temp);
}

void GTFont_Select_GT23L24M1Z(void)
{
	/*
	GT Serial Font ROM Select
	000b: GT21L16TW / GT21H16T1W
	001b: GT23L16U2W
	010b: GT23L24T3Y / GT23H24T3Y
	011b: GT23L24M1Z
	100b: GT23L32S4W / GT23H32S4W
	101b: GT20L24F6Y
	110b: GT21L24S1W
	111b: GT22L16A1Y
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCE);
	temp = LCD_DataRead();
    temp &= cClrb7;
    temp |= cSetb6;
    temp |= cSetb5;
	LCD_DataWrite(temp);
}

