Yoda49/RA8876-Driver-for-STM32F429ZIT6-FMC/RA8876_driver.c
void GTFont_Select_GT23L32S4W_GT23H32S4W(void)
{
	/*
	GT Serial Font ROM Select
	000b: GT21L16TW / GT21H16T1W
	001b: GT23L16U2W
	010b: GT23L24T3Y / GT23H24T3Y
	011b: GT23L24M1Z
	100b: GT23L32S4W / GT23H32S4W
	101b: GT20L24F6Y
	110b: GT21L24S1W
	111b: GT22L16A1Y
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCE);
	temp = LCD_DataRead();
    temp |= cSetb7;
    temp &= cClrb6;
    temp &= cClrb5;
	LCD_DataWrite(temp);
}

void GTFont_Select_GT20L24F6Y(void)
{
	/*
	GT Serial Font ROM Select
	000b: GT21L16TW / GT21H16T1W
	001b: GT23L16U2W
	010b: GT23L24T3Y / GT23H24T3Y
	011b: GT23L24M1Z
	100b: GT23L32S4W / GT23H32S4W
	101b: GT20L24F6Y
	110b: GT21L24S1W
	111b: GT22L16A1Y
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCE);
	temp = LCD_DataRead();
    temp |= cSetb7;
    temp &= cClrb6;
    temp |= cSetb5;
	LCD_DataWrite(temp);
}

void GTFont_Select_GT21L24S1W(void)
{
	/*
	GT Serial Font ROM Select
	000b: GT21L16TW / GT21H16T1W
	001b: GT23L16U2W
	010b: GT23L24T3Y / GT23H24T3Y
	011b: GT23L24M1Z
	100b: GT23L32S4W / GT23H32S4W
	101b: GT20L24F6Y
	110b: GT21L24S1W
	111b: GT22L16A1Y
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCE);
	temp = LCD_DataRead();
    temp |= cSetb7;
    temp |= cSetb6;
    temp &= cClrb5;
	LCD_DataWrite(temp);
}

void GTFont_Select_GT22L16A1Y(void)
{
	/*
	GT Serial Font ROM Select
	000b: GT21L16TW / GT21H16T1W
	001b: GT23L16U2W
	010b: GT23L24T3Y / GT23H24T3Y
	011b: GT23L24M1Z
	100b: GT23L32S4W / GT23H32S4W
	101b: GT20L24F6Y
	110b: GT21L24S1W
	111b: GT22L16A1Y
	*/
	unsigned char temp;
	LCD_CmdWrite(0xCE);
	temp = LCD_DataRead();
    temp |= cSetb7;
    temp |= cSetb6;
    temp |= cSetb5;
	LCD_DataWrite(temp);
}

//[CFh]=========================================================================
void Set_GTFont_Decoder(unsigned char temp)
{
	/*
	[bit7-3]
	FONT ROM Coding Setting
	For specific GT serial Font ROM, the coding method must be set for decoding.
	00000b: GB2312
	00001b: GB12345/GB18030
	00010b: BIG5
	00011b: UNICODE
	00100b: ASCII
	00101b: UNI-Japanese
	00110b: JIS0208
	00111b: Latin/Greek/ Cyrillic / Arabic/Thai/Hebrew
	01000b: Korea
	10001b: ISO-8859-1
	10010b: ISO-8859-2
	10011b: ISO-8859-3
	10100b: ISO-8859-4
	10101b: ISO-8859-5
	10110b: ISO-8859-6
	10111b: ISO-8859-7
	11000b: ISO-8859-8
	11001b: ISO-8859-9
	11010b: ISO-8859-10
	11011b: ISO-8859-11
	11100b: ISO-8859-12
	11101b: ISO-8859-13
	11110b: ISO-8859-14
	11111b: ISO-8859-15

	[bit1-0]
	ASCII / Latin/Greek/ Cyrillic / Arabic
			(ASCII)		(Latin/Greek/Cyrillic)	(Arabic)
	00b		Normal			Normal 					NA
	01b		Arial 		Variable Width 			Presentation Forms-A
	10b		Roman 			NA 					Presentation Forms-B
	11b		Bold			NA 						NA
	*/
	LCD_CmdWrite(0xCF);
	LCD_DataWrite(temp);
}

//[D0h]=========================================================================
void Font_Line_Distance(unsigned char temp)
{
	/*[bit4-0]
	Font Line Distance Setting
	Setting the font character line distance when setting memory font
	write cursor auto move. (Unit: pixel)
	*/
	LCD_CmdWrite(0xD0);
	LCD_DataWrite(temp);
}

//[D1h]=========================================================================
void Set_Font_to_Font_Width(unsigned char temp)
{
	/*[bit5-0]
	Font to Font Width Setting (Unit: pixel)
	*/
	LCD_CmdWrite(0xD1);
	LCD_DataWrite(temp);
}

//[D2h]~[D4h]=========================================================================
void Foreground_RGB(unsigned char RED,unsigned char GREEN,unsigned char BLUE)
{
	/*
	[D2h] Foreground Color - Red, for draw, text or color expansion
	[D3h] Foreground Color - Green, for draw, text or color expansion
	[D4h] Foreground Color - Blue, for draw, text or color expansion
	*/  
    LCD_CmdWrite(0xD2);
	LCD_DataWrite(RED);
 
    LCD_CmdWrite(0xD3);
	LCD_DataWrite(GREEN);
  
    LCD_CmdWrite(0xD4);
	LCD_DataWrite(BLUE);
}

//Input data format:R3G3B2  
void Foreground_color_256(unsigned char temp) 
{
    LCD_CmdWrite(0xD2);
	LCD_DataWrite(temp);
 
    LCD_CmdWrite(0xD3);
	LCD_DataWrite(temp<<3);
  
    LCD_CmdWrite(0xD4);
	LCD_DataWrite(temp<<6);
}
 
//Input data format:R5G6B5 
void Foreground_color_65k(unsigned short temp)
{
    LCD_CmdWrite(0xD2);
	LCD_DataWrite(temp>>8);
 
    LCD_CmdWrite(0xD3);
	LCD_DataWrite(temp>>3);
  
    LCD_CmdWrite(0xD4);
	LCD_DataWrite(temp<<3);
}
 
//Input data format:R8G8B8 
void Foreground_color_16M(unsigned long temp)
{
    LCD_CmdWrite(0xD2);
	LCD_DataWrite(temp>>16);
 
    LCD_CmdWrite(0xD3);
	LCD_DataWrite(temp>>8);
  
    LCD_CmdWrite(0xD4);
	LCD_DataWrite(temp);
}
 
 
 
//[D5h]~[D7h]=========================================================================
/*
[D5h] Background Color - Red, for Text or color expansion
[D6h] Background Color - Green, for Text or color expansion
[D7h] Background Color - Blue, for Text or color expansion
*/ 
void Background_RGB(unsigned char RED,unsigned char GREEN,unsigned char BLUE)
{
   
    LCD_CmdWrite(0xD5);
	LCD_DataWrite(RED);
  
    LCD_CmdWrite(0xD6);
	LCD_DataWrite(GREEN);
   
    LCD_CmdWrite(0xD7);
	LCD_DataWrite(BLUE);
}
 
//Input data format:R3G3B2
void Background_color_256(unsigned char temp)
{
    LCD_CmdWrite(0xD5);
	LCD_DataWrite(temp);
  
    LCD_CmdWrite(0xD6);
	LCD_DataWrite(temp<<3);
   
    LCD_CmdWrite(0xD7);
	LCD_DataWrite(temp<<6);
}
 
//Input data format:R5G6B6
void Background_color_65k(unsigned short temp)
{
    LCD_CmdWrite(0xD5);
	LCD_DataWrite(temp>>8);
  
    LCD_CmdWrite(0xD6);
	LCD_DataWrite(temp>>3);
   
    LCD_CmdWrite(0xD7);
	LCD_DataWrite(temp<<3);
}
 
//Input data format:R8G8B8
void Background_color_16M(unsigned long temp)
{
	LCD_CmdWrite(0xD5);
	LCD_DataWrite(temp>>16);
  
    LCD_CmdWrite(0xD6);
	LCD_DataWrite(temp>>8);
   
    LCD_CmdWrite(0xD7);
	LCD_DataWrite(temp);
}

//[DBh]~[DEh]=========================================================================
void CGRAM_Start_address(unsigned long Addr)
{
/*
CGRAM START ADDRESS [31:0]
*/	 
    LCD_CmdWrite(0xDB);
	LCD_DataWrite(Addr);
    LCD_CmdWrite(0xDC);
	LCD_DataWrite(Addr>>8);
    LCD_CmdWrite(0xDD);
	LCD_DataWrite(Addr>>16);
    LCD_CmdWrite(0xDE);
	LCD_DataWrite(Addr>>24);
}

//[DFh]=========================================================================
/*
[bit7] Enter Power saving state
0: Normal state.
1: Enter power saving state.
[bit1][bit0] Power saving Mode definition
00: NA
01: Standby Mode
10: Suspend Mode
11: Sleep Mode
*/
void Power_Normal_Mode(void)
{
	LCD_CmdWrite(0xDF);
	LCD_DataWrite(0x00);
}
void Power_Saving_Standby_Mode(void)
{
	LCD_CmdWrite(0xDF);
	LCD_DataWrite(0x01);
	LCD_CmdWrite(0xDF);
	LCD_DataWrite(0x81);
}
void Power_Saving_Suspend_Mode(void)
{
	LCD_CmdWrite(0xDF);
//	LCD_DataWrite(0x02);
//	LCD_CmdWrite(0xDF);
	LCD_DataWrite(0x82);
}
void Power_Saving_Sleep_Mode(void)
{
	LCD_CmdWrite(0xDF);
//	LCD_DataWrite(0x03);
//	LCD_CmdWrite(0xDF);
	LCD_DataWrite(0x83);
}


 
 



 


void Text_cursor_initial(void)
{

   //Disable_Text_Cursor();
    Enable_Text_Cursor_Blinking();
    //Disable_Text_Cursor_Blinking();
    Blinking_Time_Frames(10);
    //**[3E][3Fh]**//
    Text_Cursor_H_V(1,15);
	Enable_Text_Cursor();
}




